window.__EQUIPMENT_ITEMS__ = [
  {
    "name": "Серьги авантюриста",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Скорость бега +15",
        "HP +50",
        "Особое восстановление HP +0,5",
        "Уровень зелий здоровья +2"
      ],
      "+1": [
        "Скорость бега +18",
        "HP +75",
        "Особое восстановление HP +1",
        "Уровень зелий здоровья +2"
      ],
      "+2": [
        "Скорость бега +21",
        "HP +100",
        "Особое восстановление HP +1",
        "Уровень зелий здоровья +3"
      ],
      "+3": [
        "Скорость бега +24",
        "HP +125",
        "Особое восстановление HP +2",
        "Уровень зелий здоровья +3"
      ],
      "+4": [
        "Скорость бега +27",
        "HP +150",
        "Особое восстановление HP +2",
        "Уровень зелий здоровья +4"
      ],
      "+5": [
        "Скорость бега +30",
        "HP +175",
        "Особое восстановление HP +3",
        "Уровень зелий здоровья +4"
      ]
    }
  },
  {
    "name": "Серьги атланта",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Скорость бега +15",
        "HP +50",
        "Поглощение +4"
      ],
      "+1": [
        "Скорость бега +18",
        "HP +75",
        "Поглощение +5"
      ],
      "+2": [
        "Скорость бега +21",
        "HP +100",
        "Поглощение +6"
      ],
      "+3": [
        "Скорость бега +24",
        "HP +125",
        "Поглощение +7"
      ],
      "+4": [
        "Скорость бега +27",
        "HP +150",
        "Поглощение +8"
      ],
      "+5": [
        "Скорость бега +30",
        "HP +175",
        "Поглощение +9"
      ]
    }
  },
  {
    "name": "Серьги беспощадной расправы",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ]
    }
  },
  {
    "name": "Серьги божественной гармонии",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Все параметры +7",
        "Скорость бега +15"
      ]
    }
  },
  {
    "name": "Серьги варвара",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "HP +50",
        "Поглощение +4"
      ],
      "+1": [
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +6",
        "HP +75",
        "Поглощение +5"
      ],
      "+2": [
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +8",
        "HP +100",
        "Поглощение +6"
      ],
      "+3": [
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +10",
        "HP +125",
        "Поглощение +7"
      ],
      "+4": [
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +12",
        "HP +150",
        "Поглощение +8"
      ],
      "+5": [
        "Шанс нанести крит. удар +8",
        "Доп. урон при крит. ударе +14",
        "HP +175",
        "Поглощение +9"
      ]
    }
  },
  {
    "name": "Серьги витязя",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +1",
        "HP +50",
        "Поглощение +4"
      ],
      "+1": [
        "Точность всех атак +1",
        "HP +75",
        "Поглощение +5"
      ],
      "+2": [
        "Точность всех атак +2",
        "HP +100",
        "Поглощение +6"
      ],
      "+3": [
        "Точность всех атак +2",
        "HP +125",
        "Поглощение +7"
      ],
      "+4": [
        "Точность всех атак +3",
        "HP +150",
        "Поглощение +8"
      ],
      "+5": [
        "Точность всех атак +3",
        "HP +175",
        "Поглощение +9"
      ]
    }
  },
  {
    "name": "Серьги вождя",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +1",
        "HP +50",
        "Особое восстановление HP +0,5",
        "Уровень зелий здоровья +2"
      ],
      "+1": [
        "Точность всех атак +1",
        "HP +75",
        "Особое восстановление HP +1",
        "Уровень зелий здоровья +2"
      ],
      "+2": [
        "Точность всех атак +2",
        "HP +100",
        "Особое восстановление HP +1",
        "Уровень зелий здоровья +3"
      ],
      "+3": [
        "Точность всех атак +2",
        "HP +125",
        "Особое восстановление HP +2",
        "Уровень зелий здоровья +3"
      ],
      "+4": [
        "Точность всех атак +3",
        "HP +150",
        "Особое восстановление HP +2",
        "Уровень зелий здоровья +4"
      ],
      "+5": [
        "Точность всех атак +3",
        "HP +175",
        "Особое восстановление HP +3",
        "Уровень зелий здоровья +4"
      ]
    }
  },
  {
    "name": "Серьги воздуха",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уклонение +1"
      ]
    }
  },
  {
    "name": "Серьги восстановления",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +30",
        "Особое восстановление HP +0,1"
      ]
    }
  },
  {
    "name": "Серьги гармонии",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Все параметры +2",
        "Скорость бега +5"
      ]
    }
  },
  {
    "name": "Серьги жестокой расправы",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +2",
        "Шанс нанести крит. удар +2",
        "Доп. урон при крит. ударе +2"
      ]
    }
  },
  {
    "name": "Серьги земли",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Поглощение +1"
      ]
    }
  },
  {
    "name": "Серьги колосса",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "HP +50",
        "Особое восстановление HP +0,5",
        "Уровень зелий здоровья +2"
      ],
      "+1": [
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +6",
        "HP +75",
        "Особое восстановление HP +1",
        "Уровень зелий здоровья +2"
      ],
      "+2": [
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +8",
        "HP +100",
        "Особое восстановление HP +1",
        "Уровень зелий здоровья +3"
      ],
      "+3": [
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +10",
        "HP +125",
        "Особое восстановление HP +2",
        "Уровень зелий здоровья +3"
      ],
      "+4": [
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +12",
        "HP +150",
        "Особое восстановление HP +2",
        "Уровень зелий здоровья +4"
      ],
      "+5": [
        "Шанс нанести крит. удар +8",
        "Доп. урон при крит. ударе +14",
        "HP +175",
        "Особое восстановление HP +3",
        "Уровень зелий здоровья +4"
      ]
    }
  },
  {
    "name": "Серьги мушкетера",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +1",
        "HP +50",
        "Уклонение +4"
      ],
      "+1": [
        "Точность всех атак +1",
        "HP +75",
        "Уклонение +5"
      ],
      "+2": [
        "Точность всех атак +2",
        "HP +100",
        "Уклонение +6"
      ],
      "+3": [
        "Точность всех атак +2",
        "HP +125",
        "Уклонение +7"
      ],
      "+4": [
        "Точность всех атак +3",
        "HP +150",
        "Уклонение +8"
      ],
      "+5": [
        "Точность всех атак +3",
        "HP +175",
        "Уклонение +9"
      ]
    }
  },
  {
    "name": "Серьги океана",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Все параметры +2"
      ]
    }
  },
  {
    "name": "Серьги поглощения",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +30",
        "Поглощение +1"
      ]
    }
  },
  {
    "name": "Серьги потрошителя",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "HP +50",
        "Уклонение +4"
      ],
      "+1": [
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +6",
        "HP +75",
        "Уклонение +5"
      ],
      "+2": [
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +8",
        "HP +100",
        "Уклонение +6"
      ],
      "+3": [
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +10",
        "HP +125",
        "Уклонение +7"
      ],
      "+4": [
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +12",
        "HP +150",
        "Уклонение +8"
      ],
      "+5": [
        "Шанс нанести крит. удар +8",
        "Доп. урон при крит. ударе +14",
        "HP +175",
        "Уклонение +9"
      ]
    }
  },
  {
    "name": "Серьги праведной ярости",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +1"
      ]
    }
  },
  {
    "name": "Серьги расправы",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1"
      ]
    }
  },
  {
    "name": "Серьги святой гармонии",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Все параметры +4",
        "Скорость бега +10"
      ]
    }
  },
  {
    "name": "Серьги священной ярости",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2"
      ]
    }
  },
  {
    "name": "Серьги солнца",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1"
      ]
    }
  },
  {
    "name": "Серьги уклонения",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +30",
        "Уклонение +1"
      ]
    }
  },
  {
    "name": "Серьги улучшенного восстановления",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +40",
        "Особое восстановление HP +0,3",
        "Уровень зелий здоровья +1"
      ]
    }
  },
  {
    "name": "Серьги улучшенного поглощения",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +40",
        "Поглощение +2"
      ]
    }
  },
  {
    "name": "Серьги улучшенного уклонения",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +40",
        "Уклонение +2"
      ]
    }
  },
  {
    "name": "Серьги усиленного восстановления",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +50",
        "Особое восстановление HP +0,5",
        "Уровень зелий здоровья +2"
      ]
    }
  },
  {
    "name": "Серьги усиленного поглощения",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +50",
        "Поглощение +4"
      ]
    }
  },
  {
    "name": "Серьги усиленного уклонения",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "HP +50",
        "Уклонение +4"
      ]
    }
  },
  {
    "name": "Серьги шпиона",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Скорость бега +15",
        "HP +50",
        "Уклонение +4"
      ],
      "+1": [
        "Скорость бега +18",
        "HP +75",
        "Уклонение +5"
      ],
      "+2": [
        "Скорость бега +21",
        "HP +100",
        "Уклонение +6"
      ],
      "+3": [
        "Скорость бега +24",
        "HP +125",
        "Уклонение +7"
      ],
      "+4": [
        "Скорость бега +27",
        "HP +150",
        "Уклонение +8"
      ],
      "+5": [
        "Скорость бега +30",
        "HP +175",
        "Уклонение +9"
      ]
    }
  },
  {
    "name": "Серьги ярости",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1"
      ]
    }
  },
  {
    "name": "Улучшенные серьги воздуха",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уклонение +3"
      ]
    }
  },
  {
    "name": "Улучшенные серьги земли",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Поглощение +3"
      ]
    }
  },
  {
    "name": "Улучшенные серьги океана",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1",
        "Все параметры +2"
      ]
    }
  },
  {
    "name": "Улучшенные серьги солнца",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Точность всех атак +1"
      ]
    }
  },
  {
    "name": "Усиленные серьги воздуха",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уклонение +5",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -4",
        "Восстановление HP +0,1"
      ]
    }
  },
  {
    "name": "Усиленные серьги земли",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Поглощение +5",
        "Эффективность уровня зелий +1",
        "HP +25"
      ]
    }
  },
  {
    "name": "Усиленные серьги океана",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Точность всех атак +1",
        "Все параметры +2"
      ]
    }
  },
  {
    "name": "Усиленные серьги солнца",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +2"
      ]
    }
  },
  {
    "name": "Усовершенствованные серьги воздуха",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +7",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -4",
        "Восстановление HP +0,2"
      ]
    }
  },
  {
    "name": "Усовершенствованные серьги земли",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +7",
        "Эффективность уровня зелий +2",
        "HP +50"
      ]
    }
  },
  {
    "name": "Усовершенствованные серьги океана",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +2",
        "Все параметры +3"
      ]
    }
  },
  {
    "name": "Усовершенствованные серьги солнца",
    "slot_code": "earring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +4",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +2"
      ]
    }
  },
  {
    "name": "Магическая маска Велкена",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +9",
        "HP +25"
      ],
      "+1": [
        "Защита +10",
        "HP +30"
      ],
      "+2": [
        "Защита +11",
        "HP +35"
      ],
      "+3": [
        "Защита +12",
        "HP +40"
      ],
      "+4": [
        "Защита +13",
        "HP +45"
      ],
      "+5": [
        "Защита +14",
        "HP +50",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +15",
        "HP +55",
        "Получаемый крит. урон -2"
      ],
      "+7": [
        "Защита +17",
        "HP +60",
        "Получаемый крит. урон -3"
      ],
      "+8": [
        "Защита +19",
        "HP +65",
        "Получаемый крит. урон -4"
      ],
      "+9": [
        "Защита +21",
        "HP +70",
        "Получаемый крит. урон -5"
      ],
      "+10": [
        "Защита +23",
        "HP +75",
        "Получаемый крит. урон -6"
      ],
      "+11": [
        "Защита +25",
        "HP +80",
        "Получаемый крит. урон -7"
      ],
      "+12": [
        "Защита +27",
        "HP +85",
        "Получаемый крит. урон -8"
      ],
      "+13": [
        "Защита +29",
        "HP +90",
        "Получаемый крит. урон -9"
      ]
    }
  },
  {
    "name": "Магическая маска Велкена (прок.)",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +9",
        "HP +25"
      ],
      "+1": [
        "Защита +10",
        "HP +30"
      ],
      "+2": [
        "Защита +11",
        "HP +35"
      ],
      "+3": [
        "Защита +12",
        "HP +40"
      ],
      "+4": [
        "Защита +13",
        "HP +45"
      ],
      "+5": [
        "Защита +14",
        "HP +50",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +15",
        "HP +55",
        "Получаемый крит. урон -2"
      ],
      "+7": [
        "Защита +17",
        "HP +60",
        "Получаемый крит. урон -3"
      ],
      "+8": [
        "Защита +19",
        "HP +65",
        "Получаемый крит. урон -4"
      ],
      "+9": [
        "Защита +21",
        "HP +70",
        "Получаемый крит. урон -5"
      ],
      "+10": [
        "Защита +23",
        "HP +75",
        "Получаемый крит. урон -6"
      ],
      "+11": [
        "Защита +25",
        "HP +80",
        "Получаемый крит. урон -7"
      ],
      "+12": [
        "Защита +27",
        "HP +85",
        "Получаемый крит. урон -8"
      ],
      "+13": [
        "Защита +29",
        "HP +90",
        "Получаемый крит. урон -9"
      ]
    }
  },
  {
    "name": "Магический мифриловый шлем",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +9",
        "HP +30"
      ],
      "+1": [
        "Защита +10",
        "HP +35"
      ],
      "+2": [
        "Защита +11",
        "HP +40"
      ],
      "+3": [
        "Защита +12",
        "HP +45"
      ],
      "+4": [
        "Защита +13",
        "HP +50"
      ],
      "+5": [
        "Защита +14",
        "HP +55",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +15",
        "HP +60",
        "Получаемый крит. урон -2"
      ],
      "+7": [
        "Защита +17",
        "HP +65",
        "Получаемый крит. урон -3"
      ],
      "+8": [
        "Защита +19",
        "HP +70",
        "Получаемый крит. урон -4"
      ],
      "+9": [
        "Защита +21",
        "HP +75",
        "Получаемый крит. урон -5"
      ],
      "+10": [
        "Защита +23",
        "HP +80",
        "Получаемый крит. урон -6"
      ],
      "+11": [
        "Защита +25",
        "HP +85",
        "Получаемый крит. урон -7"
      ],
      "+12": [
        "Защита +27",
        "HP +90",
        "Получаемый крит. урон -8"
      ],
      "+13": [
        "Защита +29",
        "HP +95",
        "Получаемый крит. урон -9"
      ]
    }
  },
  {
    "name": "Магический мифриловый шлем (прок.)",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +9",
        "HP +30"
      ],
      "+1": [
        "Защита +10",
        "HP +35"
      ],
      "+2": [
        "Защита +11",
        "HP +40"
      ],
      "+3": [
        "Защита +12",
        "HP +45"
      ],
      "+4": [
        "Защита +13",
        "HP +50"
      ],
      "+5": [
        "Защита +14",
        "HP +55",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +15",
        "HP +60",
        "Получаемый крит. урон -2"
      ],
      "+7": [
        "Защита +17",
        "HP +65",
        "Получаемый крит. урон -3"
      ],
      "+8": [
        "Защита +19",
        "HP +70",
        "Получаемый крит. урон -4"
      ],
      "+9": [
        "Защита +21",
        "HP +75",
        "Получаемый крит. урон -5"
      ],
      "+10": [
        "Защита +23",
        "HP +80",
        "Получаемый крит. урон -6"
      ],
      "+11": [
        "Защита +25",
        "HP +85",
        "Получаемый крит. урон -7"
      ],
      "+12": [
        "Защита +27",
        "HP +90",
        "Получаемый крит. урон -8"
      ],
      "+13": [
        "Защита +29",
        "HP +95",
        "Получаемый крит. урон -9"
      ]
    }
  },
  {
    "name": "Маска Велкена",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +8",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника."
      ],
      "+1": [
        "Защита +9",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника."
      ],
      "+2": [
        "Защита +10",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника."
      ],
      "+3": [
        "Защита +11",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника."
      ],
      "+4": [
        "Защита +12",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника."
      ],
      "+5": [
        "Защита +13",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +14",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -1"
      ],
      "+7": [
        "Защита +16",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -2"
      ],
      "+8": [
        "Защита +18",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -3"
      ],
      "+9": [
        "Защита +20",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -4"
      ],
      "+10": [
        "Защита +22",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -5"
      ],
      "+11": [
        "Защита +24",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -6"
      ],
      "+12": [
        "Защита +26",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -7"
      ],
      "+13": [
        "Защита +28",
        "Благодаря легкому весу позволяет с легкостью уворачиваться от атак противника.",
        "Получаемый крит. урон -8"
      ]
    }
  },
  {
    "name": "Маска тьмы",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +7"
      ],
      "+1": [
        "Защита +8"
      ],
      "+2": [
        "Защита +9"
      ],
      "+3": [
        "Защита +10"
      ],
      "+4": [
        "Защита +11"
      ],
      "+5": [
        "Защита +12"
      ],
      "+6": [
        "Защита +13"
      ],
      "+7": [
        "Защита +15"
      ],
      "+8": [
        "Защита +17"
      ],
      "+9": [
        "Защита +19"
      ]
    }
  },
  {
    "name": "Маска энергии Ифрита",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +10"
      ],
      "+1": [
        "Защита +11"
      ],
      "+2": [
        "Защита +12",
        "Точность всех атак +1"
      ],
      "+3": [
        "Защита +13",
        "Точность всех атак +1"
      ],
      "+4": [
        "Защита +14",
        "Получаемый крит. урон -1",
        "Точность всех атак +2"
      ],
      "+5": [
        "Защита +15",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -2",
        "Точность всех атак +2"
      ],
      "+6": [
        "Защита +16",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -3",
        "Точность всех атак +3"
      ],
      "+7": [
        "Защита +18",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -4",
        "Точность всех атак +3"
      ],
      "+8": [
        "Защита +20",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -5",
        "Точность всех атак +3"
      ],
      "+9": [
        "Защита +22",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -6",
        "Точность всех атак +4"
      ],
      "+10": [
        "Защита +24",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -7",
        "Точность всех атак +4"
      ],
      "+11": [
        "Защита +26",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -8",
        "Точность всех атак +4"
      ],
      "+12": [
        "Защита +28",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -9",
        "Точность всех атак +4"
      ],
      "+13": [
        "Защита +30",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -10",
        "Точность всех атак +5"
      ]
    }
  },
  {
    "name": "Маска ярости Бафомета",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +9",
        "Доп. урон при крит. ударе +1"
      ],
      "+1": [
        "Защита +10",
        "Доп. урон при крит. ударе +2"
      ],
      "+2": [
        "Защита +11",
        "Доп. урон при крит. ударе +3"
      ],
      "+3": [
        "Защита +12",
        "Доп. урон при крит. ударе +4"
      ],
      "+4": [
        "Защита +13",
        "Доп. урон при крит. ударе +6"
      ],
      "+5": [
        "Защита +14",
        "Получаемый крит. урон -1",
        "Доп. урон при крит. ударе +7"
      ],
      "+6": [
        "Защита +15",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -2",
        "Доп. урон при крит. ударе +8"
      ],
      "+7": [
        "Защита +17",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -3",
        "Доп. урон при крит. ударе +9"
      ],
      "+8": [
        "Защита +19",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -4",
        "Доп. урон при крит. ударе +10"
      ],
      "+9": [
        "Защита +21",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -5",
        "Доп. урон при крит. ударе +11"
      ],
      "+10": [
        "Защита +23",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -6",
        "Доп. урон при крит. ударе +12"
      ],
      "+11": [
        "Защита +25",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -7",
        "Доп. урон при крит. ударе +13"
      ],
      "+12": [
        "Защита +27",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -8",
        "Доп. урон при крит. ударе +14"
      ],
      "+13": [
        "Защита +29",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -9",
        "Доп. урон при крит. ударе +15"
      ]
    }
  },
  {
    "name": "Мифриловый шлем",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +8"
      ],
      "+1": [
        "Защита +9"
      ],
      "+2": [
        "Защита +10"
      ],
      "+3": [
        "Защита +11"
      ],
      "+4": [
        "Защита +12"
      ],
      "+5": [
        "Защита +13",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +14",
        "Получаемый крит. урон -1"
      ],
      "+7": [
        "Защита +16",
        "Получаемый крит. урон -2"
      ],
      "+8": [
        "Защита +18",
        "Получаемый крит. урон -3"
      ],
      "+9": [
        "Защита +20",
        "Получаемый крит. урон -4"
      ],
      "+10": [
        "Защита +22",
        "Получаемый крит. урон -5"
      ],
      "+11": [
        "Защита +24",
        "Получаемый крит. урон -6"
      ],
      "+12": [
        "Защита +26",
        "Получаемый крит. урон -7"
      ],
      "+13": [
        "Защита +28",
        "Получаемый крит. урон -8"
      ]
    }
  },
  {
    "name": "Стальной шлем",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +7"
      ],
      "+1": [
        "Защита +8"
      ],
      "+2": [
        "Защита +9"
      ],
      "+3": [
        "Защита +10"
      ],
      "+4": [
        "Защита +11"
      ],
      "+5": [
        "Защита +12"
      ],
      "+6": [
        "Защита +13"
      ],
      "+7": [
        "Защита +15"
      ],
      "+8": [
        "Защита +17"
      ],
      "+9": [
        "Защита +19"
      ],
      "+10": [
        "Защита +21"
      ],
      "+11": [
        "Защита +23"
      ],
      "+12": [
        "Защита +25"
      ],
      "+13": [
        "Защита +27"
      ]
    }
  },
  {
    "name": "Шлем Бафомета",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +9"
      ],
      "+1": [
        "Защита +10"
      ],
      "+2": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Доп. урон при крит. ударе +1"
      ],
      "+3": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "Точность всех атак +1",
        "Доп. урон при крит. ударе +2"
      ],
      "+4": [
        "Защита +13",
        "Шанс получить крит. удар -1",
        "Точность всех атак +1",
        "Доп. урон при крит. ударе +3"
      ],
      "+5": [
        "Защита +14",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Точность всех атак +2",
        "Доп. урон при крит. ударе +4"
      ],
      "+6": [
        "Защита +15",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2",
        "Точность всех атак +2",
        "Доп. урон при крит. ударе +5"
      ],
      "+7": [
        "Защита +17",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Точность всех атак +3",
        "Доп. урон при крит. ударе +5"
      ],
      "+8": [
        "Защита +19",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4",
        "Точность всех атак +3",
        "Доп. урон при крит. ударе +6"
      ],
      "+9": [
        "Защита +21",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Точность всех атак +4",
        "Доп. урон при крит. ударе +6"
      ],
      "+10": [
        "Защита +23",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6",
        "Точность всех атак +4",
        "Доп. урон при крит. ударе +7"
      ],
      "+11": [
        "Защита +25",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -7",
        "Точность всех атак +5",
        "Доп. урон при крит. ударе +7"
      ],
      "+12": [
        "Защита +27",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -8",
        "Точность всех атак +5",
        "Доп. урон при крит. ударе +8"
      ],
      "+13": [
        "Защита +29",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -9",
        "Точность всех атак +6",
        "Доп. урон при крит. ударе +8"
      ]
    }
  },
  {
    "name": "Шлем Ифрита",
    "slot_code": "helmet",
    "upgrade_levels": {
      "+0": [
        "Защита +10",
        "HP +45"
      ],
      "+1": [
        "Защита +11",
        "HP +50",
        "Шанс получить крит. удар -1"
      ],
      "+2": [
        "Защита +12",
        "HP +55",
        "Шанс получить крит. удар -1"
      ],
      "+3": [
        "Защита +13",
        "HP +60",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1"
      ],
      "+4": [
        "Защита +14",
        "HP +65",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1"
      ],
      "+5": [
        "Защита +15",
        "HP +70",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2"
      ],
      "+6": [
        "Защита +16",
        "HP +75",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3"
      ],
      "+7": [
        "Защита +18",
        "HP +80",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4"
      ],
      "+8": [
        "Защита +20",
        "HP +85",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5"
      ],
      "+9": [
        "Защита +22",
        "HP +90",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6"
      ],
      "+10": [
        "Защита +24",
        "HP +95",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -7"
      ],
      "+11": [
        "Защита +26",
        "HP +100",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -8"
      ],
      "+12": [
        "Защита +28",
        "HP +105",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -9"
      ],
      "+13": [
        "Защита +30",
        "HP +110",
        "Шанс получить крит. удар -8",
        "Получаемый крит. урон -10"
      ]
    }
  },
  {
    "name": "Магический мифриловый плащ",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "HP +10"
      ],
      "+1": [
        "Защита +4",
        "HP +15"
      ],
      "+2": [
        "Защита +5",
        "HP +20"
      ],
      "+3": [
        "Защита +6",
        "HP +25"
      ],
      "+4": [
        "Защита +7",
        "HP +30"
      ],
      "+5": [
        "Защита +8",
        "HP +35"
      ],
      "+6": [
        "Защита +9",
        "HP +40"
      ],
      "+7": [
        "Защита +11",
        "HP +45",
        "Шанс получить крит. удар -1"
      ],
      "+8": [
        "Защита +13",
        "HP +50",
        "Шанс получить крит. удар -1"
      ],
      "+9": [
        "Защита +15",
        "HP +55",
        "Шанс получить крит. удар -2"
      ],
      "+10": [
        "Защита +17",
        "HP +60",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +19",
        "HP +65",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +21",
        "HP +70",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +23",
        "HP +75",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Магический мифриловый плащ (прок.)",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "HP +10"
      ],
      "+1": [
        "Защита +4",
        "HP +15"
      ],
      "+2": [
        "Защита +5",
        "HP +20"
      ],
      "+3": [
        "Защита +6",
        "HP +25"
      ],
      "+4": [
        "Защита +7",
        "HP +30"
      ],
      "+5": [
        "Защита +8",
        "HP +35"
      ],
      "+6": [
        "Защита +9",
        "HP +40"
      ],
      "+7": [
        "Защита +11",
        "HP +45",
        "Шанс получить крит. удар -1"
      ],
      "+8": [
        "Защита +13",
        "HP +50",
        "Шанс получить крит. удар -1"
      ],
      "+9": [
        "Защита +15",
        "HP +55",
        "Шанс получить крит. удар -2"
      ],
      "+10": [
        "Защита +17",
        "HP +60",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +19",
        "HP +65",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +21",
        "HP +70",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +23",
        "HP +75",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Мифриловый плащ",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +2"
      ],
      "+1": [
        "Защита +3"
      ],
      "+2": [
        "Защита +4"
      ],
      "+3": [
        "Защита +5"
      ],
      "+4": [
        "Защита +6"
      ],
      "+5": [
        "Защита +7"
      ],
      "+6": [
        "Защита +8"
      ],
      "+7": [
        "Защита +10"
      ],
      "+8": [
        "Защита +12",
        "Шанс получить крит. удар -1"
      ],
      "+9": [
        "Защита +14",
        "Шанс получить крит. удар -1"
      ],
      "+10": [
        "Защита +16",
        "Шанс получить крит. удар -2"
      ],
      "+11": [
        "Защита +18",
        "Шанс получить крит. удар -2"
      ],
      "+12": [
        "Защита +20",
        "Шанс получить крит. удар -3"
      ],
      "+13": [
        "Защита +22",
        "Шанс получить крит. удар -4"
      ]
    }
  },
  {
    "name": "Обычный плащ",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +1"
      ]
    }
  },
  {
    "name": "Плащ Бафомета",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "Скорость бега +3"
      ],
      "+1": [
        "Защита +4",
        "Скорость бега +6"
      ],
      "+2": [
        "Защита +5",
        "Скорость бега +9"
      ],
      "+3": [
        "Защита +6",
        "Скорость бега +12"
      ],
      "+4": [
        "Защита +7",
        "Уровень всех атак +1",
        "Скорость бега +15"
      ],
      "+5": [
        "Защита +8",
        "Уровень всех атак +2",
        "Скорость бега +18"
      ],
      "+6": [
        "Защита +9",
        "Получаемый крит. урон -1",
        "Уровень всех атак +2",
        "Скорость бега +21"
      ],
      "+7": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Уровень всех атак +3",
        "Скорость бега +24"
      ],
      "+8": [
        "Защита +13",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -2",
        "Уровень всех атак +3",
        "Скорость бега +27"
      ],
      "+9": [
        "Защита +15",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -3",
        "Уровень всех атак +3",
        "Скорость бега +30"
      ],
      "+10": [
        "Защита +17",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4",
        "Уровень всех атак +4",
        "Скорость бега +33"
      ],
      "+11": [
        "Защита +19",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Уровень всех атак +4",
        "Скорость бега +36"
      ],
      "+12": [
        "Защита +21",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Уровень всех атак +4",
        "Скорость бега +39"
      ],
      "+13": [
        "Защита +23",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Уровень всех атак +4",
        "Скорость бега +42"
      ]
    }
  },
  {
    "name": "Плащ Ифрита",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +4"
      ],
      "+1": [
        "Защита +5"
      ],
      "+2": [
        "Защита +6"
      ],
      "+3": [
        "Защита +7",
        "Все параметры +1"
      ],
      "+4": [
        "Защита +8",
        "Все параметры +1"
      ],
      "+5": [
        "Защита +9",
        "Получаемый крит. урон -1",
        "Все параметры +2"
      ],
      "+6": [
        "Защита +10",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Все параметры +2"
      ],
      "+7": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -2",
        "Все параметры +3"
      ],
      "+8": [
        "Защита +14",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -3",
        "Все параметры +3"
      ],
      "+9": [
        "Защита +16",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4",
        "Все параметры +4"
      ],
      "+10": [
        "Защита +18",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Все параметры +4"
      ],
      "+11": [
        "Защита +20",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Все параметры +5"
      ],
      "+12": [
        "Защита +22",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Все параметры +5"
      ],
      "+13": [
        "Защита +24",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -8",
        "Все параметры +6"
      ]
    }
  },
  {
    "name": "Плащ невидимости",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +4",
        "Невидимость 1 ур."
      ]
    }
  },
  {
    "name": "Плащ невидимости (легендарный)",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +4",
        "Невидимость 4 ур.",
        "Снижает уровень эффекта обнаружения."
      ]
    }
  },
  {
    "name": "Плащ невидимости (редкий)",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +4",
        "Невидимость 2 ур.",
        "Снижает уровень эффекта обнаружения."
      ]
    }
  },
  {
    "name": "Плащ невидимости (эпический)",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +4",
        "Невидимость 3 ур.",
        "Снижает уровень эффекта обнаружения."
      ]
    }
  },
  {
    "name": "Плащ новичка",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "MP +10"
      ]
    }
  },
  {
    "name": "Плащ смотрителя",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень защиты: 4"
      ]
    }
  },
  {
    "name": "Плащ смотрителя (легендарный)",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": []
    }
  },
  {
    "name": "Плащ смотрителя (редкий)",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень защиты: 4"
      ]
    }
  },
  {
    "name": "Плащ смотрителя (эпический)",
    "slot_code": "cloak",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень защиты: 4"
      ]
    }
  },
  {
    "name": "Блестящее ожерелье интеллекта",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ожерелье, увеличивающее интеллект.",
        "Точность магических атак +1",
        "Интеллект +3"
      ]
    }
  },
  {
    "name": "Блестящее ожерелье ловкости",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ожерелье, увеличивающее ловкость.",
        "Точность дальних атак +1",
        "Ловкость +3"
      ]
    }
  },
  {
    "name": "Блестящее ожерелье силы",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Точность ближних атак +1",
        "Сила +3"
      ]
    }
  },
  {
    "name": "Ледяное ожерелье",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уклонение +4"
      ]
    }
  },
  {
    "name": "Ожерелье берсерка",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Сила +3",
        "Уровень ближних атак +3",
        "Точность ближних атак +1"
      ],
      "+1": [
        "Сила +4",
        "Уровень ближних атак +3",
        "Точность ближних атак +1"
      ],
      "+2": [
        "Сила +4",
        "Уровень ближних атак +4",
        "Точность ближних атак +2"
      ],
      "+3": [
        "Сила +4",
        "Уровень ближних атак +5",
        "Точность ближних атак +2"
      ],
      "+5": [
        "Сила +5",
        "Уровень ближних атак +7",
        "Точность ближних атак +3"
      ]
    }
  },
  {
    "name": "Ожерелье беспощадной расправы",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ]
    }
  },
  {
    "name": "Ожерелье божественного поглощения",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Поглощение +2"
      ]
    }
  },
  {
    "name": "Ожерелье воздуха",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +1"
      ]
    }
  },
  {
    "name": "Ожерелье восстановления",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,1",
        "Восстановление MP +0,1",
        "Вес +400"
      ]
    }
  },
  {
    "name": "Ожерелье выживания",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "HP +30",
        "MP +15",
        "Вес +400"
      ]
    }
  },
  {
    "name": "Ожерелье высокого интеллекта",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ожерелье, увеличивающее интеллект.",
        "Уровень магических атак +1",
        "Точность магических атак +1",
        "Интеллект +3"
      ]
    }
  },
  {
    "name": "Ожерелье высокой ловкости",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ожерелье, увеличивающее ловкость.",
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +3"
      ]
    }
  },
  {
    "name": "Ожерелье высокой силы",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Сила +3"
      ]
    }
  },
  {
    "name": "Ожерелье гладиатора",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уклонение +4",
        "HP+50",
        "MP+25",
        "Получаемый крит. урон -2"
      ],
      "+1": [
        "Уклонение +5",
        "HP+100",
        "MP+50",
        "Получаемый крит. урон -4"
      ],
      "+2": [
        "Уклонение +6",
        "HP+200",
        "MP+100",
        "Получаемый крит. урон -6"
      ],
      "+3": [
        "Уклонение +7",
        "HP+250",
        "MP+125",
        "Получаемый крит. урон -8"
      ],
      "+4": [
        "Уклонение +8",
        "HP+350",
        "MP+175",
        "Получаемый крит. урон -10"
      ],
      "+5": [
        "Уклонение +9",
        "HP+400",
        "MP+200",
        "Получаемый крит. урон -12"
      ]
    }
  },
  {
    "name": "Ожерелье головореза",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ловкость +3",
        "Уровень дальних атак +3",
        "Точность дальних атак +1"
      ],
      "+1": [
        "Ловкость +4",
        "Уровень дальних атак +3",
        "Точность дальних атак +1"
      ],
      "+2": [
        "Ловкость +4",
        "Уровень дальних атак +4",
        "Точность дальних атак +2"
      ],
      "+3": [
        "Ловкость +4",
        "Уровень дальних атак +5",
        "Точность дальних атак +2"
      ],
      "+4": [
        "Ловкость +5",
        "Уровень дальних атак +6",
        "Точность дальних атак +2"
      ],
      "+5": [
        "Ловкость +5",
        "Уровень дальних атак +7",
        "Точность дальних атак +3"
      ]
    }
  },
  {
    "name": "Ожерелье жестокой расправы",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +2",
        "Шанс нанести крит. удар +2",
        "Доп. урон при крит. ударе +2"
      ]
    }
  },
  {
    "name": "Ожерелье земли",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +1"
      ]
    }
  },
  {
    "name": "Ожерелье интеллекта",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ожерелье, увеличивающее интеллект.",
        "Интеллект +1"
      ]
    }
  },
  {
    "name": "Ожерелье карателя",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Сила +3",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ],
      "+1": [
        "Сила +4",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ],
      "+2": [
        "Сила +5",
        "Точность ближних атак +4",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +4"
      ],
      "+3": [
        "Сила +6",
        "Точность ближних атак +4",
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +4"
      ],
      "+4": [
        "Сила +7",
        "Точность ближних атак +5",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +5"
      ],
      "+5": [
        "Сила +8",
        "Точность ближних атак +6",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +5"
      ]
    }
  },
  {
    "name": "Ожерелье ловкости",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ожерелье, увеличивающее ловкость.",
        "Ловкость +1"
      ]
    }
  },
  {
    "name": "Ожерелье мастера",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Все параметры +1"
      ]
    }
  },
  {
    "name": "Ожерелье новичка",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "HP +25"
      ]
    }
  },
  {
    "name": "Ожерелье океана",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Все параметры +2"
      ]
    }
  },
  {
    "name": "Ожерелье охотника",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ловкость +3",
        "Точность дальних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ],
      "+1": [
        "Ловкость +4",
        "Точность дальних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ],
      "+2": [
        "Ловкость +5",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +4"
      ],
      "+3": [
        "Ловкость +6",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +4"
      ],
      "+4": [
        "Ловкость +7",
        "Точность дальних атак +5",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +5"
      ],
      "+5": [
        "Ловкость +8",
        "Точность дальних атак +6",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +5"
      ]
    }
  },
  {
    "name": "Ожерелье поглощения",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Поглощение +1"
      ]
    }
  },
  {
    "name": "Ожерелье праведной ярости",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +1"
      ]
    }
  },
  {
    "name": "Ожерелье пророка",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уклонение +4",
        "Восстановление HP +0,3",
        "Восстановление MP +0,3",
        "Шанс получить крит. урон -1",
        "Эффект зелий здоровья +1"
      ],
      "+1": [
        "Уклонение +5",
        "Восстановление HP +0,4",
        "Восстановление MP +0,4",
        "Шанс получить крит. урон -2",
        "Эффект зелий здоровья +2"
      ],
      "+2": [
        "Уклонение +6",
        "Восстановление HP +0,5",
        "Восстановление MP +0,5",
        "Шанс получить крит. урон -3",
        "Эффект зелий здоровья +4"
      ],
      "+3": [
        "Уклонение +7",
        "Восстановление HP +0,6",
        "Восстановление MP +0,6",
        "Шанс получить крит. урон -4",
        "Эффект зелий здоровья +5"
      ],
      "+4": [
        "Уклонение +8",
        "Восстановление HP +0,7",
        "Восстановление MP +0,7",
        "Шанс получить крит. урон -5",
        "Эффект зелий здоровья +7"
      ],
      "+5": [
        "Уклонение +9",
        "Восстановление HP +0,8",
        "Восстановление MP +0,8",
        "Шанс получить крит. урон -6",
        "Эффект зелий здоровья +8"
      ]
    }
  },
  {
    "name": "Ожерелье расправы",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1"
      ]
    }
  },
  {
    "name": "Ожерелье ратника",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Поглощение +4",
        "HP+50",
        "MP+25",
        "Получаемый крит. урон -2"
      ],
      "+1": [
        "Поглощение +5",
        "HP+100",
        "MP+50",
        "Получаемый крит. урон -4"
      ],
      "+2": [
        "Поглощение +6",
        "HP+200",
        "MP+100",
        "Получаемый крит. урон -6"
      ],
      "+3": [
        "Поглощение +7",
        "HP+250",
        "MP+125",
        "Получаемый крит. урон -8"
      ],
      "+4": [
        "Поглощение +8",
        "HP+350",
        "MP+175",
        "Получаемый крит. урон -10"
      ],
      "+5": [
        "Поглощение +9",
        "HP+400",
        "MP+200",
        "Получаемый крит. урон -12"
      ]
    }
  },
  {
    "name": "Ожерелье святого поглощения",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Поглощение +4"
      ]
    }
  },
  {
    "name": "Ожерелье священной ярости",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2"
      ]
    }
  },
  {
    "name": "Ожерелье силы",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Сила +1"
      ]
    }
  },
  {
    "name": "Ожерелье солнца",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1"
      ]
    }
  },
  {
    "name": "Ожерелье уклонения",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уклонение +1"
      ]
    }
  },
  {
    "name": "Ожерелье фанатика",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Поглощение +4",
        "Восстановление HP +0,3",
        "Восстановление MP +0,3",
        "Шанс получить крит. урон -1",
        "Эффект зелий здоровья +1"
      ],
      "+1": [
        "Поглощение +5",
        "Восстановление HP +0,4",
        "Восстановление MP +0,4",
        "Шанс получить крит. урон -2",
        "Эффект зелий здоровья +2"
      ],
      "+2": [
        "Поглощение +6",
        "Восстановление HP +0,5",
        "Восстановление MP +0,5",
        "Шанс получить крит. урон -3",
        "Эффект зелий здоровья +4"
      ],
      "+3": [
        "Поглощение +7",
        "Восстановление HP +0,6",
        "Восстановление MP +0,6",
        "Шанс получить крит. урон -4",
        "Эффект зелий здоровья +5"
      ],
      "+4": [
        "Поглощение +8",
        "Восстановление HP +0,7",
        "Восстановление MP +0,7",
        "Шанс получить крит. урон -5",
        "Эффект зелий здоровья +7"
      ],
      "+5": [
        "Поглощение +9",
        "Восстановление HP +0,8",
        "Восстановление MP +0,8",
        "Шанс получить крит. урон -6",
        "Эффект зелий здоровья +8"
      ]
    }
  },
  {
    "name": "Ожерелье чародея",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Интеллект +3",
        "Точность магических атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ],
      "+1": [
        "Интеллект +4",
        "Точность магических атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ],
      "+2": [
        "Интеллект +5",
        "Точность магических атак +4",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +4"
      ],
      "+3": [
        "Интеллект +6",
        "Точность магических атак +4",
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +4"
      ],
      "+4": [
        "Интеллект +7",
        "Точность магических атак +5",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +5"
      ],
      "+5": [
        "Интеллект +8",
        "Точность магических атак +6",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +5"
      ]
    }
  },
  {
    "name": "Ожерелье чернокнижника",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Интеллект +3",
        "Уровень магических атак +3",
        "Точность магических атак +1"
      ],
      "+1": [
        "Интеллект +4",
        "Уровень магических атак +3",
        "Точность магических атак +1"
      ],
      "+2": [
        "Интеллект +4",
        "Уровень магических атак +4",
        "Точность магических атак +2"
      ],
      "+3": [
        "Интеллект +4",
        "Уровень магических атак +5",
        "Точность магических атак +2"
      ],
      "+4": [
        "Интеллект +5",
        "Уровень магических атак +6",
        "Точность магических атак +2"
      ],
      "+5": [
        "Интеллект +5",
        "Уровень магических атак +7",
        "Точность магических атак +3"
      ]
    }
  },
  {
    "name": "Ожерелье ярости",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1"
      ]
    }
  },
  {
    "name": "Светящееся ожерелье интеллекта",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ожерелье, увеличивающее интеллект.",
        "Интеллект +2"
      ]
    }
  },
  {
    "name": "Светящееся ожерелье ловкости",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Ожерелье, увеличивающее ловкость.",
        "Ловкость +2"
      ]
    }
  },
  {
    "name": "Светящееся ожерелье силы",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Сила +2"
      ]
    }
  },
  {
    "name": "Стеклянное ожерелье",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уклонение +2"
      ]
    }
  },
  {
    "name": "Улучшенное ожерелье воздуха",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +3"
      ]
    }
  },
  {
    "name": "Улучшенное ожерелье восстановления",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,2",
        "Восстановление MP +0,2",
        "Вес +800"
      ]
    }
  },
  {
    "name": "Улучшенное ожерелье выживания",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "HP +40",
        "MP +20",
        "Вес +800"
      ]
    }
  },
  {
    "name": "Улучшенное ожерелье земли",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +3"
      ]
    }
  },
  {
    "name": "Улучшенное ожерелье океана",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1",
        "Все параметры +2"
      ]
    }
  },
  {
    "name": "Улучшенное ожерелье солнца",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Точность всех атак +1"
      ]
    }
  },
  {
    "name": "Усиленное ожерелье воздуха",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +5"
      ]
    }
  },
  {
    "name": "Усиленное ожерелье восстановления",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,3",
        "Восстановление MP +0,3",
        "Вес +1200"
      ]
    }
  },
  {
    "name": "Усиленное ожерелье выживания",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "HP +50",
        "MP +25",
        "Вес +1200"
      ]
    }
  },
  {
    "name": "Усиленное ожерелье земли",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +5"
      ]
    }
  },
  {
    "name": "Усиленное ожерелье океана",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Точность всех атак +1",
        "Все параметры +2"
      ]
    }
  },
  {
    "name": "Усиленное ожерелье солнца",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +2"
      ]
    }
  },
  {
    "name": "Усовершенствованное ожерелье воздуха",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +7",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -2"
      ]
    }
  },
  {
    "name": "Усовершенствованное ожерелье земли",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +7",
        "Эффективность уровня зелий +1",
        "HP +25"
      ]
    }
  },
  {
    "name": "Усовершенствованное ожерелье океана",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +2",
        "Все параметры +2"
      ]
    }
  },
  {
    "name": "Усовершенствованное ожерелье солнца",
    "slot_code": "necklace",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +4",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1"
      ]
    }
  },
  {
    "name": "Доспех Велкена",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +9",
        "HP +50"
      ],
      "+1": [
        "Защита +10",
        "HP +50"
      ],
      "+2": [
        "Защита +11",
        "HP +50"
      ],
      "+3": [
        "Защита +12",
        "HP +50",
        "Получаемый крит. урон -1"
      ],
      "+4": [
        "Защита +13",
        "HP +50",
        "Получаемый крит. урон -2"
      ],
      "+5": [
        "Защита +14",
        "HP +50",
        "Получаемый крит. урон -3"
      ],
      "+6": [
        "Защита +15",
        "HP +50",
        "Получаемый крит. урон -4"
      ],
      "+7": [
        "Защита +17",
        "HP +50",
        "Получаемый крит. урон -5"
      ],
      "+8": [
        "Защита +19",
        "HP +50",
        "Получаемый крит. урон -6"
      ],
      "+9": [
        "Защита +21",
        "HP +50",
        "Получаемый крит. урон -7"
      ],
      "+10": [
        "Защита +23",
        "HP +50",
        "Получаемый крит. урон -8"
      ],
      "+11": [
        "Защита +25",
        "HP +50",
        "Получаемый крит. урон -9"
      ],
      "+12": [
        "Защита +27",
        "HP +50",
        "Получаемый крит. урон -10"
      ],
      "+13": [
        "Защита +29",
        "HP +50",
        "Получаемый крит. урон -11"
      ]
    }
  },
  {
    "name": "Доспех тьмы",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +8"
      ]
    }
  },
  {
    "name": "Доспех энергии Ифрита",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +11",
        "HP +120"
      ],
      "+1": [
        "Защита +12",
        "HP +130",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +13",
        "HP +140",
        "Получаемый крит. урон -1"
      ],
      "+3": [
        "Защита +14",
        "HP +150",
        "Получаемый крит. урон -2"
      ],
      "+4": [
        "Защита +15",
        "HP +160",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -3"
      ],
      "+5": [
        "Защита +16",
        "HP +170",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -4"
      ],
      "+6": [
        "Защита +17",
        "HP +180",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -5"
      ],
      "+7": [
        "Защита +19",
        "HP +190",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -6"
      ],
      "+8": [
        "Защита +21",
        "HP +200",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -7"
      ],
      "+9": [
        "Защита +23",
        "HP +210",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -8"
      ],
      "+10": [
        "Защита +25",
        "HP +220",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -9"
      ],
      "+11": [
        "Защита +27",
        "HP +230",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -10"
      ],
      "+12": [
        "Защита +29",
        "HP +240",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -11"
      ],
      "+13": [
        "Защита +31",
        "HP +250",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -12"
      ]
    }
  },
  {
    "name": "Доспех ярости Бафомета",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +10"
      ],
      "+1": [
        "Защита +11",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +12",
        "Получаемый крит. урон -1",
        "Точность всех атак +1"
      ],
      "+3": [
        "Защита +13",
        "Получаемый крит. урон -2",
        "Уровень всех атак +1",
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1"
      ],
      "+4": [
        "Защита +14",
        "Получаемый крит. урон -2",
        "Уровень всех атак +2",
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1"
      ],
      "+5": [
        "Защита +15",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -3",
        "Уровень всех атак +2",
        "Точность всех атак +2",
        "Шанс нанести крит. удар +2"
      ],
      "+6": [
        "Защита +16",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -4",
        "Уровень всех атак +2",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +2"
      ],
      "+7": [
        "Защита +18",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -5",
        "Уровень всех атак +2",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +3"
      ],
      "+8": [
        "Защита +20",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -6",
        "Уровень всех атак +2",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +3"
      ],
      "+9": [
        "Защита +22",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -7",
        "Уровень всех атак +2",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +4"
      ],
      "+10": [
        "Защита +24",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -8",
        "Уровень всех атак +3",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +4"
      ],
      "+11": [
        "Защита +26",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -9",
        "Уровень всех атак +3",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +5"
      ],
      "+12": [
        "Защита +28",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -10",
        "Уровень всех атак +3",
        "Точность всех атак +5",
        "Шанс нанести крит. удар +5"
      ],
      "+13": [
        "Защита +30",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -11",
        "Уровень всех атак +3",
        "Точность всех атак +5",
        "Шанс нанести крит. удар +6"
      ]
    }
  },
  {
    "name": "Железный пластинчатый доспех",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +10"
      ]
    }
  },
  {
    "name": "Кольчужный доспех",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +8"
      ]
    }
  },
  {
    "name": "Легкий доспех Бафомета",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +10",
        "Шанс получить крит. удар -1"
      ],
      "+1": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Шанс нанести крит. удар +1"
      ],
      "+3": [
        "Защита +13",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2",
        "Шанс нанести крит. удар +1",
        "Точность всех атак +1"
      ],
      "+4": [
        "Защита +14",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2",
        "Уровень всех атак +1",
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1"
      ],
      "+5": [
        "Защита +15",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Уровень всех атак +1",
        "Точность всех атак +1",
        "Шанс нанести крит. удар +2"
      ],
      "+6": [
        "Защита +16",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4",
        "Уровень всех атак +1",
        "Точность всех атак +2",
        "Шанс нанести крит. удар +2"
      ],
      "+7": [
        "Защита +18",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Уровень всех атак +2",
        "Точность всех атак +2",
        "Шанс нанести крит. удар +2"
      ],
      "+8": [
        "Защита +20",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6",
        "Уровень всех атак +2",
        "Точность всех атак +2",
        "Шанс нанести крит. удар +3"
      ],
      "+9": [
        "Защита +22",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -7",
        "Уровень всех атак +2",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +3"
      ],
      "+10": [
        "Защита +24",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -8",
        "Уровень всех атак +3",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +3"
      ],
      "+11": [
        "Защита +26",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -9",
        "Уровень всех атак +3",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +4"
      ],
      "+12": [
        "Защита +28",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -10",
        "Уровень всех атак +3",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +4"
      ],
      "+13": [
        "Защита +30",
        "Шанс получить крит. удар -8",
        "Получаемый крит. урон -11",
        "Уровень всех атак +4",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +4"
      ]
    }
  },
  {
    "name": "Легкий доспех Ифрита",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +11",
        "HP +120",
        "Шанс получить крит. удар -1"
      ],
      "+1": [
        "Защита +12",
        "HP +130",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +13",
        "HP +140",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1"
      ],
      "+3": [
        "Защита +14",
        "HP +150",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2"
      ],
      "+4": [
        "Защита +15",
        "HP +160",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3"
      ],
      "+5": [
        "Защита +16",
        "HP +170",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4"
      ],
      "+6": [
        "Защита +17",
        "HP +180",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5"
      ],
      "+7": [
        "Защита +19",
        "HP +190",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6"
      ],
      "+8": [
        "Защита +21",
        "HP +200",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -7"
      ],
      "+9": [
        "Защита +23",
        "HP +210",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -8"
      ],
      "+10": [
        "Защита +25",
        "HP +220",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -9"
      ],
      "+11": [
        "Защита +27",
        "HP +230",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -10"
      ],
      "+12": [
        "Защита +29",
        "HP +240",
        "Шанс получить крит. удар -8",
        "Получаемый крит. урон -11"
      ],
      "+13": [
        "Защита +31",
        "HP +250",
        "Шанс получить крит. удар -9",
        "Получаемый крит. урон -12"
      ]
    }
  },
  {
    "name": "Легкий магический мифриловый доспех",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +10",
        "HP +90"
      ],
      "+1": [
        "Защита +11",
        "HP +95",
        "Шанс получить крит. удар -1"
      ],
      "+2": [
        "Защита +12",
        "HP +100",
        "Шанс получить крит. удар -1"
      ],
      "+3": [
        "Защита +13",
        "HP +105",
        "Шанс получить крит. удар -2"
      ],
      "+4": [
        "Защита +14",
        "HP +110",
        "Шанс получить крит. удар -2"
      ],
      "+5": [
        "Защита +15",
        "HP +115",
        "Шанс получить крит. удар -3"
      ],
      "+6": [
        "Защита +16",
        "HP +120",
        "Шанс получить крит. удар -4"
      ],
      "+7": [
        "Защита +18",
        "HP +125",
        "Шанс получить крит. удар -5"
      ],
      "+8": [
        "Защита +20",
        "HP +130",
        "Шанс получить крит. удар -6"
      ],
      "+9": [
        "Защита +22",
        "HP +135",
        "Шанс получить крит. удар -7"
      ],
      "+10": [
        "Защита +24",
        "HP +140",
        "Шанс получить крит. удар -8"
      ],
      "+11": [
        "Защита +26",
        "HP +145",
        "Шанс получить крит. удар -9"
      ],
      "+12": [
        "Защита +28",
        "HP +150",
        "Шанс получить крит. удар -10"
      ],
      "+13": [
        "Защита +30",
        "HP +155",
        "Шанс получить крит. удар -11"
      ]
    }
  },
  {
    "name": "Легкий магический мифриловый доспех (прок.)",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +10",
        "HP +90"
      ],
      "+1": [
        "Защита +11",
        "HP +95",
        "Шанс получить крит. удар -1"
      ],
      "+2": [
        "Защита +12",
        "HP +100",
        "Шанс получить крит. удар -1"
      ],
      "+3": [
        "Защита +13",
        "HP +105",
        "Шанс получить крит. удар -2"
      ],
      "+4": [
        "Защита +14",
        "HP +110",
        "Шанс получить крит. удар -2"
      ],
      "+5": [
        "Защита +15",
        "HP +115",
        "Шанс получить крит. удар -3"
      ],
      "+6": [
        "Защита +16",
        "HP +120",
        "Шанс получить крит. удар -4"
      ],
      "+7": [
        "Защита +18",
        "HP +125",
        "Шанс получить крит. удар -5"
      ],
      "+8": [
        "Защита +20",
        "HP +130",
        "Шанс получить крит. удар -6"
      ],
      "+9": [
        "Защита +22",
        "HP +135",
        "Шанс получить крит. удар -7"
      ],
      "+10": [
        "Защита +24",
        "HP +140",
        "Шанс получить крит. удар -8"
      ],
      "+11": [
        "Защита +26",
        "HP +145",
        "Шанс получить крит. удар -9"
      ],
      "+12": [
        "Защита +28",
        "HP +150",
        "Шанс получить крит. удар -10"
      ],
      "+13": [
        "Защита +30",
        "HP +155",
        "Шанс получить крит. удар -11"
      ]
    }
  },
  {
    "name": "Легкий мифриловый доспех",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +9",
        "HP +50"
      ],
      "+1": [
        "Защита +10",
        "HP +50"
      ],
      "+2": [
        "Защита +11",
        "HP +50"
      ],
      "+3": [
        "Защита +12",
        "HP +50",
        "Получаемый крит. урон -1"
      ],
      "+4": [
        "Защита +13",
        "HP +50",
        "Получаемый крит. урон -1"
      ],
      "+5": [
        "Защита +14",
        "HP +50",
        "Получаемый крит. урон -2"
      ],
      "+6": [
        "Защита +15",
        "HP +50",
        "Получаемый крит. урон -3"
      ],
      "+7": [
        "Защита +17",
        "HP +50",
        "Получаемый крит. урон -4"
      ],
      "+8": [
        "Защита +19",
        "HP +50",
        "Получаемый крит. урон -5"
      ],
      "+9": [
        "Защита +21",
        "HP +50",
        "Получаемый крит. урон -6"
      ],
      "+10": [
        "Защита +23",
        "HP +50",
        "Получаемый крит. урон -7"
      ],
      "+11": [
        "Защита +25",
        "HP +50",
        "Получаемый крит. урон -8"
      ],
      "+12": [
        "Защита +27",
        "HP +50",
        "Получаемый крит. урон -9"
      ],
      "+13": [
        "Защита +29",
        "HP +50",
        "Получаемый крит. урон -10"
      ]
    }
  },
  {
    "name": "Магический доспех Велкена",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +10",
        "HP +85"
      ],
      "+1": [
        "Защита +11",
        "HP +90",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +12",
        "HP +95",
        "Получаемый крит. урон -1"
      ],
      "+3": [
        "Защита +13",
        "HP +100",
        "Получаемый крит. урон -2"
      ],
      "+4": [
        "Защита +14",
        "HP +105",
        "Получаемый крит. урон -2"
      ],
      "+5": [
        "Защита +15",
        "HP +110",
        "Получаемый крит. урон -3"
      ],
      "+6": [
        "Защита +16",
        "HP +115",
        "Получаемый крит. урон -4"
      ],
      "+7": [
        "Защита +18",
        "HP +120",
        "Получаемый крит. урон -5"
      ],
      "+8": [
        "Защита +20",
        "HP +125",
        "Получаемый крит. урон -6"
      ],
      "+9": [
        "Защита +22",
        "HP +130",
        "Получаемый крит. урон -7"
      ],
      "+10": [
        "Защита +24",
        "HP +135",
        "Получаемый крит. урон -8"
      ],
      "+11": [
        "Защита +26",
        "HP +140",
        "Получаемый крит. урон -9"
      ],
      "+12": [
        "Защита +28",
        "HP +145",
        "Получаемый крит. урон -10"
      ],
      "+13": [
        "Защита +30",
        "HP +150",
        "Получаемый крит. урон -11"
      ]
    }
  },
  {
    "name": "Магический доспех Велкена (прок.)",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +10",
        "HP +85"
      ],
      "+1": [
        "Защита +11",
        "HP +90",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +12",
        "HP +95",
        "Получаемый крит. урон -1"
      ],
      "+3": [
        "Защита +13",
        "HP +100",
        "Получаемый крит. урон -2"
      ],
      "+4": [
        "Защита +14",
        "HP +105",
        "Получаемый крит. урон -2"
      ],
      "+5": [
        "Защита +15",
        "HP +110",
        "Получаемый крит. урон -3"
      ],
      "+6": [
        "Защита +16",
        "HP +115",
        "Получаемый крит. урон -4"
      ],
      "+7": [
        "Защита +18",
        "HP +120",
        "Получаемый крит. урон -5"
      ],
      "+8": [
        "Защита +20",
        "HP +125",
        "Получаемый крит. урон -6"
      ],
      "+9": [
        "Защита +22",
        "HP +130",
        "Получаемый крит. урон -7"
      ],
      "+10": [
        "Защита +24",
        "HP +135",
        "Получаемый крит. урон -8"
      ],
      "+11": [
        "Защита +26",
        "HP +140",
        "Получаемый крит. урон -9"
      ],
      "+12": [
        "Защита +28",
        "HP +145",
        "Получаемый крит. урон -10"
      ],
      "+13": [
        "Защита +30",
        "HP +150",
        "Получаемый крит. урон -11"
      ]
    }
  },
  {
    "name": "Тяжелый Доспех Ифрита",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +13",
        "HP+120",
        "Шанс получить крит. удар -1"
      ],
      "+1": [
        "Защита +14",
        "HP+130",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +15",
        "HP+140",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2"
      ],
      "+3": [
        "Защита +16",
        "HP+150",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -3"
      ],
      "+4": [
        "Защита +17",
        "HP+160",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4"
      ],
      "+5": [
        "Защита +18",
        "HP+170",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -5"
      ],
      "+6": [
        "Защита +19",
        "HP+180",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6"
      ],
      "+7": [
        "Защита +21",
        "HP+190",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -7"
      ],
      "+8": [
        "Защита +23",
        "HP+200",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -8"
      ],
      "+9": [
        "Защита +25",
        "HP+210",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -9"
      ],
      "+10": [
        "Защита +27",
        "HP+220",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -10"
      ],
      "+11": [
        "Защита +29",
        "HP+230",
        "Шанс получить крит. удар -8",
        "Получаемый крит. урон -11"
      ],
      "+12": [
        "Защита +31",
        "HP+240",
        "Шанс получить крит. удар -9",
        "Получаемый крит. урон -12"
      ],
      "+13": [
        "Защита +33",
        "HP+250",
        "Шанс получить крит. удар -10",
        "Получаемый крит. урон -13"
      ]
    }
  },
  {
    "name": "Тяжелый доспех Бафомета",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "Точность всех атак +1"
      ],
      "+1": [
        "Защита +13",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1"
      ],
      "+2": [
        "Защита +14",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Точность всех атак +2",
        "Шанс нанести крит. удар +1"
      ],
      "+3": [
        "Защита +15",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2",
        "Уровень всех атак +1",
        "Точность всех атак +2",
        "Шанс нанести крит. удар +1"
      ],
      "+4": [
        "Защита +16",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -3",
        "Уровень всех атак +1",
        "Точность всех атак +2",
        "Шанс нанести крит. удар +2"
      ],
      "+5": [
        "Защита +17",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4",
        "Уровень всех атак +1",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +2"
      ],
      "+6": [
        "Защита +18",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -5",
        "Уровень всех атак +2",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +2"
      ],
      "+7": [
        "Защита +20",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6",
        "Уровень всех атак +2",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +3"
      ],
      "+8": [
        "Защита +22",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -7",
        "Уровень всех атак +2",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +3"
      ],
      "+9": [
        "Защита +24",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -8",
        "Уровень всех атак +3",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +3"
      ],
      "+10": [
        "Защита +26",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -9",
        "Уровень всех атак +3",
        "Точность всех атак +4",
        "Шанс нанести крит. удар +4"
      ],
      "+11": [
        "Защита +28",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -10",
        "Уровень всех атак +3",
        "Точность всех атак +5",
        "Шанс нанести крит. удар +4"
      ],
      "+12": [
        "Защита +30",
        "Шанс получить крит. удар -8",
        "Получаемый крит. урон -11",
        "Уровень всех атак +4",
        "Точность всех атак +5",
        "Шанс нанести крит. удар +4"
      ],
      "+13": [
        "Защита +32",
        "Шанс получить крит. удар -9",
        "Получаемый крит. урон -12",
        "Уровень всех атак +4",
        "Точность всех атак +5",
        "Шанс нанести крит. удар +5"
      ]
    }
  },
  {
    "name": "Тяжелый магический мифриловый доспех",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +12",
        "HP +100"
      ],
      "+1": [
        "Защита +13",
        "HP +105",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +14",
        "HP +110",
        "Получаемый крит. урон -1"
      ],
      "+3": [
        "Защита +15",
        "HP +115",
        "Получаемый крит. урон -2"
      ],
      "+4": [
        "Защита +16",
        "HP +120",
        "Получаемый крит. урон -3"
      ],
      "+5": [
        "Защита +17",
        "HP +125",
        "Получаемый крит. урон -4"
      ],
      "+6": [
        "Защита +18",
        "HP +130",
        "Получаемый крит. урон -5"
      ],
      "+7": [
        "Защита +20",
        "HP +135",
        "Получаемый крит. урон -6"
      ],
      "+8": [
        "Защита +22",
        "HP +140",
        "Получаемый крит. урон -7"
      ],
      "+9": [
        "Защита +24",
        "HP +145",
        "Получаемый крит. урон -8"
      ],
      "+10": [
        "Защита +26",
        "HP +150",
        "Получаемый крит. урон -9"
      ],
      "+11": [
        "Защита +28",
        "HP +155",
        "Получаемый крит. урон -10"
      ],
      "+12": [
        "Защита +30",
        "HP +160",
        "Получаемый крит. урон -11"
      ],
      "+13": [
        "Защита +32",
        "HP +165",
        "Получаемый крит. урон -12"
      ]
    }
  },
  {
    "name": "Тяжелый магический мифриловый доспех (прок.)",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +12",
        "HP +100"
      ],
      "+1": [
        "Защита +13",
        "HP +105",
        "Получаемый крит. урон -1"
      ],
      "+2": [
        "Защита +14",
        "HP +110",
        "Получаемый крит. урон -1"
      ],
      "+3": [
        "Защита +15",
        "HP +115",
        "Получаемый крит. урон -2"
      ],
      "+4": [
        "Защита +16",
        "HP +120",
        "Получаемый крит. урон -3"
      ],
      "+5": [
        "Защита +17",
        "HP +125",
        "Получаемый крит. урон -4"
      ],
      "+6": [
        "Защита +18",
        "HP +130",
        "Получаемый крит. урон -5"
      ],
      "+7": [
        "Защита +20",
        "HP +135",
        "Получаемый крит. урон -6"
      ],
      "+8": [
        "Защита +22",
        "HP +140",
        "Получаемый крит. урон -7"
      ],
      "+9": [
        "Защита +24",
        "HP +145",
        "Получаемый крит. урон -8"
      ],
      "+10": [
        "Защита +26",
        "HP +150",
        "Получаемый крит. урон -9"
      ],
      "+11": [
        "Защита +28",
        "HP +155",
        "Получаемый крит. урон -10"
      ],
      "+12": [
        "Защита +30",
        "HP +160",
        "Получаемый крит. урон -11"
      ],
      "+13": [
        "Защита +32",
        "HP +165",
        "Получаемый крит. урон -12"
      ]
    }
  },
  {
    "name": "Тяжелый мифриловый доспех",
    "slot_code": "armor",
    "upgrade_levels": {
      "+0": [
        "Защита +11",
        "HP+60"
      ],
      "+1": [
        "Защита +12",
        "HP+60"
      ],
      "+2": [
        "Защита +13",
        "HP+60"
      ],
      "+3": [
        "Защита +14",
        "HP +60",
        "Получаемый крит. урон -1"
      ],
      "+4": [
        "Защита +15",
        "HP +60",
        "Получаемый крит. урон -2"
      ],
      "+5": [
        "Защита +16",
        "HP +60",
        "Получаемый крит. урон -3"
      ],
      "+6": [
        "Защита +17",
        "HP +60",
        "Получаемый крит. урон -4"
      ],
      "+7": [
        "Защита +19",
        "HP +60",
        "Получаемый крит. урон -5"
      ],
      "+8": [
        "Защита +21",
        "HP +60",
        "Получаемый крит. урон -6"
      ],
      "+9": [
        "Защита +23",
        "HP +60",
        "Получаемый крит. урон -7"
      ],
      "+10": [
        "Защита +25",
        "HP +60",
        "Получаемый крит. урон -8"
      ],
      "+11": [
        "Защита +27",
        "HP +60",
        "Получаемый крит. урон -9"
      ],
      "+12": [
        "Защита +29",
        "HP +60",
        "Получаемый крит. урон -10"
      ],
      "+13": [
        "Защита +31",
        "HP +60",
        "Получаемый крит. урон -11"
      ]
    }
  },
  {
    "name": "Большой щит",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +4"
      ],
      "+1": [
        "Защита +5"
      ],
      "+2": [
        "Защита +6"
      ],
      "+3": [
        "Защита +7"
      ],
      "+4": [
        "Защита +8"
      ],
      "+5": [
        "Защита +9",
        "Шанс получить крит. удар -1"
      ],
      "+6": [
        "Защита +10",
        "Шанс получить крит. удар -1"
      ],
      "+7": [
        "Защита +12",
        "Шанс получить крит. удар -1"
      ],
      "+8": [
        "Защита +14",
        "Шанс получить крит. удар -1"
      ],
      "+9": [
        "Защита +16",
        "Шанс получить крит. удар -2"
      ],
      "+10": [
        "Защита +18",
        "Шанс получить крит. удар -2"
      ],
      "+11": [
        "Защита +20",
        "Шанс получить крит. удар -2"
      ],
      "+12": [
        "Защита +22",
        "Шанс получить крит. удар -2"
      ],
      "+13": [
        "Защита +24",
        "Шанс получить крит. удар -3"
      ]
    }
  },
  {
    "name": "Браслет Бафомета",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1"
      ],
      "+1": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Сила +1"
      ],
      "+2": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1",
        "Сила +2"
      ],
      "+3": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1",
        "Сила +2"
      ],
      "+4": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Шанс нанести крит. удар +2",
        "Доп. урон при крит. ударе +1",
        "Сила +3"
      ],
      "+5": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Шанс нанести крит. удар +2",
        "Доп. урон при крит. ударе +2",
        "Сила +4"
      ],
      "+6": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +2",
        "Доп. урон при крит. ударе +2",
        "Сила +4"
      ],
      "+7": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +3",
        "Сила +5"
      ],
      "+8": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +4",
        "Сила +6"
      ],
      "+9": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +4",
        "Сила +6"
      ],
      "+10": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +5",
        "Сила +7"
      ],
      "+11": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +6",
        "Сила +8"
      ],
      "+12": [
        "Уровень ближних атак +5",
        "Точность ближних атак +5",
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +6",
        "Сила +8"
      ],
      "+13": [
        "Уровень ближних атак +5",
        "Точность ближних атак +5",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +7",
        "Сила +9"
      ]
    }
  },
  {
    "name": "Браслет Ифрита",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +4",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+1": [
        "Защита +5",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+2": [
        "Защита +6",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+3": [
        "Защита +7",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+4": [
        "Защита +8",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1"
      ],
      "+5": [
        "Защита +9",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2"
      ],
      "+6": [
        "Защита +10",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3"
      ],
      "+7": [
        "Защита +12",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4"
      ],
      "+8": [
        "Защита +14",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5"
      ],
      "+9": [
        "Защита +16",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6"
      ],
      "+10": [
        "Защита +18",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -7"
      ],
      "+11": [
        "Защита +20",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -8"
      ],
      "+12": [
        "Защита +22",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -9"
      ],
      "+13": [
        "Защита +24",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -8",
        "Получаемый крит. урон -10"
      ]
    }
  },
  {
    "name": "Браслет новичка",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "HP +10"
      ]
    }
  },
  {
    "name": "Браслет убийцы",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Точность ближних атак +1"
      ],
      "+1": [
        "Точность ближних атак +1",
        "Сила +1"
      ],
      "+2": [
        "Точность ближних атак +1",
        "Сила +2"
      ],
      "+3": [
        "Точность ближних атак +2",
        "Сила +2"
      ],
      "+4": [
        "Точность ближних атак +2",
        "Сила +3"
      ],
      "+5": [
        "Точность ближних атак +2",
        "Сила +4"
      ],
      "+6": [
        "Точность ближних атак +3",
        "Сила +4"
      ],
      "+7": [
        "Точность ближних атак +3",
        "Сила +5"
      ],
      "+8": [
        "Точность ближних атак +3",
        "Сила +6"
      ],
      "+9": [
        "Точность ближних атак +4",
        "Сила +6"
      ],
      "+10": [
        "Точность ближних атак +4",
        "Сила +7"
      ],
      "+11": [
        "Точность ближних атак +4",
        "Сила +8"
      ],
      "+12": [
        "Точность ближних атак +5",
        "Сила +8"
      ],
      "+13": [
        "Точность ближних атак +5",
        "Сила +9"
      ]
    }
  },
  {
    "name": "Браслет хранителя",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +1",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ]
    }
  },
  {
    "name": "Камень души Бафомета",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +3"
      ],
      "+1": [
        "Уровень дальних атак +3"
      ],
      "+2": [
        "Уровень дальних атак +3"
      ],
      "+3": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +3",
        "Шанс нанести крит. удар +1",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +3",
        "Шанс нанести крит. удар +2",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +4",
        "Шанс нанести крит. удар +2",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +4",
        "Шанс нанести крит. удар +3",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +5",
        "Шанс нанести крит. удар +3",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +5",
        "Шанс нанести крит. удар +4",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +6",
        "Шанс нанести крит. удар +4",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +6",
        "Шанс нанести крит. удар +5",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +7",
        "Шанс нанести крит. удар +5",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +7",
        "Шанс нанести крит. удар +6",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Камень души Ифрита",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +3"
      ],
      "+1": [
        "Уровень дальних атак +3"
      ],
      "+2": [
        "Уровень дальних атак +3"
      ],
      "+3": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +3",
        "Скорость атаки +2%",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +3",
        "Скорость атаки +3%",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +4",
        "Скорость атаки +4%",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +4",
        "Скорость атаки +5%",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +5",
        "Скорость атаки +6%",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +5",
        "Скорость атаки +7%",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +6",
        "Скорость атаки +8%",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +6",
        "Скорость атаки +9%",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +7",
        "Скорость атаки +10%",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +7",
        "Скорость атаки +11%",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Колчан магических стрел",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +3"
      ],
      "+1": [
        "Уровень дальних атак +3"
      ],
      "+2": [
        "Уровень дальних атак +3"
      ],
      "+3": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +3",
        "Точность дальних атак +3",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +3",
        "Точность дальних атак +3",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +4",
        "Точность дальних атак +3",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +4",
        "Точность дальних атак +3",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +5",
        "Точность дальних атак +3",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +5",
        "Точность дальних атак +3",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +6",
        "Точность дальних атак +3",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +6",
        "Точность дальних атак +3",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +7",
        "Точность дальних атак +3",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +7",
        "Точность дальних атак +3",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Колчан магических стрел (прок.)",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +3"
      ],
      "+1": [
        "Уровень дальних атак +3"
      ],
      "+2": [
        "Уровень дальних атак +3"
      ],
      "+3": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +3",
        "Точность дальних атак +3",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +3",
        "Точность дальних атак +3",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +4",
        "Точность дальних атак +3",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +4",
        "Точность дальних атак +3",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +5",
        "Точность дальних атак +3",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +5",
        "Точность дальних атак +3",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +6",
        "Точность дальних атак +3",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +6",
        "Точность дальних атак +3",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +7",
        "Точность дальних атак +3",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +7",
        "Точность дальних атак +3",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Колчан мифриловых стрел",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +2"
      ],
      "+1": [
        "Уровень дальних атак +2"
      ],
      "+2": [
        "Уровень дальних атак +2"
      ],
      "+3": [
        "Уровень дальних атак +2",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +2",
        "Точность дальних атак +2",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +2",
        "Точность дальних атак +2",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +3",
        "Точность дальних атак +2",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +3",
        "Точность дальних атак +2",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +4",
        "Точность дальних атак +2",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +4",
        "Точность дальних атак +2",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +5",
        "Точность дальних атак +2",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +5",
        "Точность дальних атак +2",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +6",
        "Точность дальних атак +2",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +6",
        "Точность дальних атак +2",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Колчан стальных стрел",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +1"
      ],
      "+1": [
        "Уровень дальних атак +1"
      ],
      "+2": [
        "Уровень дальних атак +1"
      ],
      "+3": [
        "Уровень дальних атак +1",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Колчан стрел Бафомета",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +3"
      ],
      "+1": [
        "Уровень дальних атак +3"
      ],
      "+2": [
        "Уровень дальних атак +3"
      ],
      "+3": [
        "Уровень дальних атак +3",
        "Скорость атаки +1%",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +3",
        "Точность дальних атак +4",
        "Скорость атаки +2%",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +3",
        "Точность дальних атак +4",
        "Скорость атаки +4%",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +4",
        "Точность дальних атак +4",
        "Скорость атаки +5%",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +4",
        "Точность дальних атак +4",
        "Скорость атаки +7%",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +5",
        "Точность дальних атак +4",
        "Скорость атаки +8%",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +5",
        "Точность дальних атак +4",
        "Скорость атаки +10%",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +6",
        "Точность дальних атак +4",
        "Скорость атаки +11%",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +6",
        "Точность дальних атак +4",
        "Скорость атаки +13%",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +7",
        "Точность дальних атак +4",
        "Скорость атаки +14%",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +7",
        "Точность дальних атак +4",
        "Скорость атаки +16%",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Колчан стрел Ифрита",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +3"
      ],
      "+1": [
        "Уровень дальних атак +3"
      ],
      "+2": [
        "Уровень дальних атак +3"
      ],
      "+3": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +3",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +1",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +3",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +2",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +4",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +2",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +4",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +3",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +5",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +3",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +5",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +4",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +6",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +4",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +6",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +5",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +7",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +5",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +7",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +6",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Костяной щит",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +5",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+1": [
        "Защита +6",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+2": [
        "Защита +7",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+3": [
        "Защита +8",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+4": [
        "Защита +9",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+5": [
        "Защита +10",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +11",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -2"
      ],
      "+7": [
        "Защита +13",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -3"
      ],
      "+8": [
        "Защита +15",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -4"
      ],
      "+9": [
        "Защита +17",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -5"
      ],
      "+10": [
        "Защита +19",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -6"
      ],
      "+11": [
        "Защита +21",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -7"
      ],
      "+12": [
        "Защита +23",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -8"
      ],
      "+13": [
        "Защита +25",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -9"
      ]
    }
  },
  {
    "name": "Костяной щит (прок.)",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +5",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+1": [
        "Защита +6",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+2": [
        "Защита +7",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+3": [
        "Защита +8",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+4": [
        "Защита +9",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+5": [
        "Защита +10",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +11",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -2"
      ],
      "+7": [
        "Защита +13",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -3"
      ],
      "+8": [
        "Защита +15",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -4"
      ],
      "+9": [
        "Защита +17",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -5"
      ],
      "+10": [
        "Защита +19",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -6"
      ],
      "+11": [
        "Защита +21",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -7"
      ],
      "+12": [
        "Защита +23",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -8"
      ],
      "+13": [
        "Защита +25",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Получаемый крит. урон -9"
      ]
    }
  },
  {
    "name": "Магический браслет убийцы",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1"
      ],
      "+1": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Сила +1"
      ],
      "+2": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Доп. урон при крит. ударе +1",
        "Сила +2"
      ],
      "+3": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Доп. урон при крит. ударе +1",
        "Сила +2"
      ],
      "+4": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Доп. урон при крит. ударе +1",
        "Сила +3"
      ],
      "+5": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Доп. урон при крит. ударе +2",
        "Сила +4"
      ],
      "+6": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Доп. урон при крит. ударе +2",
        "Сила +4"
      ],
      "+7": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Доп. урон при крит. ударе +3",
        "Сила +5"
      ],
      "+8": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Доп. урон при крит. ударе +4",
        "Сила +6"
      ],
      "+9": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Доп. урон при крит. ударе +4",
        "Сила +6"
      ],
      "+10": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Доп. урон при крит. ударе +5",
        "Сила +7"
      ],
      "+11": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Доп. урон при крит. ударе +6",
        "Сила +8"
      ],
      "+12": [
        "Уровень ближних атак +5",
        "Точность ближних атак +5",
        "Доп. урон при крит. ударе +6",
        "Сила +8"
      ],
      "+13": [
        "Уровень ближних атак +5",
        "Точность ближних атак +5",
        "Доп. урон при крит. ударе +7",
        "Сила +9"
      ]
    }
  },
  {
    "name": "Магический браслет убийцы (прок.)",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+1": [
        "Защита +4",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+2": [
        "Защита +5",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+3": [
        "Защита +6",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+4": [
        "Защита +7",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+5": [
        "Защита +8",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+6": [
        "Защита +9",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ],
      "+7": [
        "Защита +11",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ],
      "+8": [
        "Защита +13",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4"
      ],
      "+9": [
        "Защита +15",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4"
      ],
      "+10": [
        "Защита +17",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -5"
      ],
      "+11": [
        "Защита +19",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -6"
      ],
      "+12": [
        "Защита +21",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -7"
      ],
      "+13": [
        "Защита +23",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -8"
      ]
    }
  },
  {
    "name": "Магический браслет хранителя",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+1": [
        "Защита +4",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+2": [
        "Защита +5",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+3": [
        "Защита +6",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+4": [
        "Защита +7",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+5": [
        "Защита +8",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+6": [
        "Защита +9",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ],
      "+7": [
        "Защита +11",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ],
      "+8": [
        "Защита +13",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4"
      ],
      "+9": [
        "Защита +15",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4"
      ],
      "+10": [
        "Защита +17",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -5"
      ],
      "+11": [
        "Защита +19",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -6"
      ],
      "+12": [
        "Защита +21",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -7"
      ],
      "+13": [
        "Защита +23",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -8"
      ]
    }
  },
  {
    "name": "Магический браслет хранителя (прок.)",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1"
      ],
      "+1": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Сила +1"
      ],
      "+2": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Сила +2"
      ],
      "+3": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Сила +2"
      ],
      "+4": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Сила +3"
      ],
      "+5": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Сила +4"
      ],
      "+6": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Сила +4"
      ],
      "+7": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Сила +5"
      ],
      "+8": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Сила +6"
      ],
      "+9": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Сила +6"
      ],
      "+10": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Сила +7"
      ],
      "+11": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Сила +8"
      ],
      "+12": [
        "Уровень ближних атак +5",
        "Точность ближних атак +5",
        "Сила +8"
      ],
      "+13": [
        "Уровень ближних атак +5",
        "Точность ближних атак +5",
        "Сила +9"
      ]
    }
  },
  {
    "name": "Магический камень души",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +3"
      ],
      "+1": [
        "Уровень дальних атак +3"
      ],
      "+2": [
        "Уровень дальних атак +3"
      ],
      "+3": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +3",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +4",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +4",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +5",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +5",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +6",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +6",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +7",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +7",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Магический камень души (прок.)",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +3"
      ],
      "+1": [
        "Уровень дальних атак +3"
      ],
      "+2": [
        "Уровень дальних атак +3"
      ],
      "+3": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +3",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +3",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +4",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +4",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +5",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +5",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +6",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +6",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +7",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +7",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Магический мифриловый фолиант",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень магических атак +3"
      ],
      "+1": [
        "Уровень магических атак +4"
      ],
      "+2": [
        "Уровень магических атак +4",
        "Интеллект +1"
      ],
      "+3": [
        "Уровень магических атак +5",
        "Интеллект +1"
      ],
      "+4": [
        "Уровень магических атак +5",
        "Интеллект +2"
      ],
      "+5": [
        "Уровень магических атак +6",
        "Интеллект +2"
      ],
      "+6": [
        "Уровень магических атак +7",
        "Интеллект +3"
      ],
      "+7": [
        "Уровень магических атак +8",
        "Интеллект +3"
      ],
      "+8": [
        "Уровень магических атак +9",
        "Интеллект +4"
      ],
      "+9": [
        "Уровень магических атак +10",
        "Интеллект +4"
      ],
      "+10": [
        "Уровень магических атак +11",
        "Интеллект +5"
      ],
      "+11": [
        "Уровень магических атак +12",
        "Интеллект +5"
      ],
      "+12": [
        "Уровень магических атак +13",
        "Интеллект +6"
      ],
      "+13": [
        "Уровень магических атак +14",
        "Интеллект +6"
      ]
    }
  },
  {
    "name": "Мифриловый браслет убийцы",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1"
      ],
      "+1": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Сила +1"
      ],
      "+2": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Сила +2"
      ],
      "+3": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Сила +2"
      ],
      "+4": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Сила +3"
      ],
      "+5": [
        "Уровень ближних атак +2",
        "Точность ближних атак +2",
        "Сила +4"
      ],
      "+6": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Сила +4"
      ],
      "+7": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Сила +5"
      ],
      "+8": [
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Сила +6"
      ],
      "+9": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Сила +6"
      ],
      "+10": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Сила +7"
      ],
      "+11": [
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Сила +8"
      ],
      "+12": [
        "Уровень ближних атак +5",
        "Точность ближних атак +5",
        "Сила +8"
      ],
      "+13": [
        "Уровень ближних атак +5",
        "Точность ближних атак +5",
        "Сила +9"
      ]
    }
  },
  {
    "name": "Мифриловый браслет хранителя",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +2",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+1": [
        "Защита +3",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+2": [
        "Защита +4",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+3": [
        "Защита +5",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+4": [
        "Защита +6",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+5": [
        "Защита +7",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+6": [
        "Защита +8",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+7": [
        "Защита +10",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+8": [
        "Защита +12",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+9": [
        "Защита +14",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+10": [
        "Защита +16",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+11": [
        "Защита +18",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+12": [
        "Защита +20",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+13": [
        "Защита +22",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ]
    }
  },
  {
    "name": "Мифриловый камень души",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +2"
      ],
      "+1": [
        "Уровень дальних атак +2"
      ],
      "+2": [
        "Уровень дальних атак +2"
      ],
      "+3": [
        "Уровень дальних атак +2",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +2",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +2",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +3",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +3",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +4",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +4",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +5",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +5",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +6",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +6",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Мифриловый фолиант",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень магических атак +2"
      ],
      "+1": [
        "Уровень магических атак +2"
      ],
      "+2": [
        "Уровень магических атак +3"
      ],
      "+3": [
        "Уровень магических атак +3",
        "Интеллект +1"
      ],
      "+4": [
        "Уровень магических атак +4",
        "Интеллект +1"
      ],
      "+5": [
        "Уровень магических атак +4",
        "Интеллект +2"
      ],
      "+6": [
        "Уровень магических атак +5",
        "Интеллект +2"
      ],
      "+7": [
        "Уровень магических атак +6",
        "Интеллект +3"
      ],
      "+8": [
        "Уровень магических атак +7",
        "Интеллект +3"
      ],
      "+9": [
        "Уровень магических атак +8",
        "Интеллект +4"
      ],
      "+10": [
        "Уровень магических атак +9",
        "Интеллект +4"
      ],
      "+11": [
        "Уровень магических атак +10",
        "Интеллект +5"
      ],
      "+12": [
        "Уровень магических атак +11",
        "Интеллект +5"
      ],
      "+13": [
        "Уровень магических атак +12",
        "Интеллект +6"
      ]
    }
  },
  {
    "name": "Средний щит",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "Щит, немного неудобный в использовании из-за своего веса и размера."
      ]
    }
  },
  {
    "name": "Стальной камень души",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень дальних атак +1"
      ],
      "+1": [
        "Уровень дальних атак +1"
      ],
      "+2": [
        "Уровень дальних атак +1"
      ],
      "+3": [
        "Уровень дальних атак +1",
        "Ловкость +1"
      ],
      "+4": [
        "Уровень дальних атак +1",
        "Ловкость +1"
      ],
      "+5": [
        "Уровень дальних атак +1",
        "Ловкость +2"
      ],
      "+6": [
        "Уровень дальних атак +1",
        "Ловкость +2"
      ],
      "+7": [
        "Уровень дальних атак +1",
        "Ловкость +3"
      ],
      "+8": [
        "Уровень дальних атак +1",
        "Ловкость +3"
      ],
      "+9": [
        "Уровень дальних атак +1",
        "Ловкость +4"
      ],
      "+10": [
        "Уровень дальних атак +1",
        "Ловкость +4"
      ],
      "+11": [
        "Уровень дальних атак +1",
        "Ловкость +5"
      ],
      "+12": [
        "Уровень дальних атак +1",
        "Ловкость +5"
      ],
      "+13": [
        "Уровень дальних атак +1",
        "Ловкость +6"
      ]
    }
  },
  {
    "name": "Тренировочная деревянная стрела",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Расходуется, в отличие от колчана. Пригодится при тестировании скорости атаки.",
        "Базовый уровень атаки 1"
      ]
    }
  },
  {
    "name": "Тренировочные камни души",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Расходуется, в отличие от обычных камней. Пригодится при тестировании скорости атаки.",
        "Базовый уровень атаки 1"
      ]
    }
  },
  {
    "name": "Фолиант",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень магических атак +1"
      ],
      "+1": [
        "Уровень магических атак +1"
      ],
      "+2": [
        "Уровень магических атак +1"
      ],
      "+3": [
        "Уровень магических атак +2"
      ],
      "+4": [
        "Уровень магических атак +2",
        "Интеллект +1"
      ],
      "+5": [
        "Уровень магических атак +3",
        "Интеллект +1"
      ],
      "+6": [
        "Уровень магических атак +3",
        "Интеллект +2"
      ],
      "+7": [
        "Уровень магических атак +4",
        "Интеллект +2"
      ],
      "+8": [
        "Уровень магических атак +5",
        "Интеллект +3"
      ],
      "+9": [
        "Уровень магических атак +6",
        "Интеллект +3"
      ],
      "+10": [
        "Уровень магических атак +7",
        "Интеллект +4"
      ],
      "+11": [
        "Уровень магических атак +8",
        "Интеллект +4"
      ],
      "+12": [
        "Уровень магических атак +9",
        "Интеллект +5"
      ],
      "+13": [
        "Уровень магических атак +10",
        "Интеллект +5"
      ]
    }
  },
  {
    "name": "Фолиант Бафомета",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень магических атак +4"
      ],
      "+1": [
        "Уровень магических атак +5",
        "Шанс крит. удара +1"
      ],
      "+2": [
        "Уровень магических атак +5",
        "Интеллект +1",
        "Шанс крит. удара +1"
      ],
      "+3": [
        "Уровень магических атак +6",
        "Интеллект +1",
        "Шанс крит. удара +2"
      ],
      "+4": [
        "Уровень магических атак +6",
        "Интеллект +2",
        "Шанс крит. удара +2"
      ],
      "+5": [
        "Уровень магических атак +7",
        "Интеллект +2",
        "Шанс крит. удара +3"
      ],
      "+6": [
        "Уровень магических атак +8",
        "Интеллект +3",
        "Шанс крит. удара +3"
      ],
      "+7": [
        "Уровень магических атак +9",
        "Интеллект +3",
        "Шанс крит. удара +5"
      ],
      "+8": [
        "Уровень магических атак +10",
        "Интеллект +4",
        "Шанс крит. удара +5"
      ],
      "+9": [
        "Уровень магических атак +11",
        "Интеллект +4",
        "Шанс крит. удара +7"
      ],
      "+10": [
        "Уровень магических атак +12",
        "Интеллект +5",
        "Шанс крит. удара +7"
      ],
      "+11": [
        "Уровень магических атак +13",
        "Интеллект +5",
        "Шанс крит. удара +9"
      ],
      "+12": [
        "Уровень магических атак +14",
        "Интеллект +6",
        "Шанс крит. удара +9"
      ],
      "+13": [
        "Уровень магических атак +15",
        "Интеллект +6",
        "Шанс крит. удара +11"
      ]
    }
  },
  {
    "name": "Фолиант Ифрита",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень магических атак +4",
        "Скорость атаки +1%"
      ],
      "+1": [
        "Уровень магических атак +5",
        "Скорость атаки +2%"
      ],
      "+2": [
        "Уровень магических атак +5",
        "Интеллект +1",
        "Скорость атаки +3%"
      ],
      "+3": [
        "Уровень магических атак +6",
        "Интеллект +1",
        "Скорость атаки +4%"
      ],
      "+4": [
        "Уровень магических атак +6",
        "Интеллект +2",
        "Скорость атаки +5%"
      ],
      "+5": [
        "Уровень магических атак +7",
        "Интеллект +2",
        "Скорость атаки +7%"
      ],
      "+6": [
        "Уровень магических атак +8",
        "Интеллект +3",
        "Скорость атаки +8%"
      ],
      "+7": [
        "Уровень магических атак +9",
        "Интеллект +3",
        "Скорость атаки +10%"
      ],
      "+8": [
        "Уровень магических атак +10",
        "Интеллект +4",
        "Скорость атаки +11%"
      ],
      "+9": [
        "Уровень магических атак +11",
        "Интеллект +4",
        "Скорость атаки +13%"
      ],
      "+10": [
        "Уровень магических атак +12",
        "Интеллект +5",
        "Скорость атаки +14%"
      ],
      "+11": [
        "Уровень магических атак +13",
        "Интеллект +5",
        "Скорость атаки +16%"
      ],
      "+12": [
        "Уровень магических атак +14",
        "Интеллект +6",
        "Скорость атаки +17%"
      ],
      "+13": [
        "Уровень магических атак +15",
        "Интеллект +6",
        "Скорость атаки +19%"
      ]
    }
  },
  {
    "name": "Фолиант новичка",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Уровень магических атак +1"
      ]
    }
  },
  {
    "name": "Щит Бафомета",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+1": [
        "Защита +7",
        "Чем выше уровень усиления тем выше уровень поглощения."
      ],
      "+2": [
        "Защита +8",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -1"
      ],
      "+3": [
        "Защита +9",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -1"
      ],
      "+4": [
        "Защита +10",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1"
      ],
      "+5": [
        "Защита +11",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2"
      ],
      "+6": [
        "Защита +12",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3"
      ],
      "+7": [
        "Защита +14",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4"
      ],
      "+8": [
        "Защита +16",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5"
      ],
      "+9": [
        "Защита +18",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6"
      ],
      "+10": [
        "Защита +20",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -7"
      ],
      "+11": [
        "Защита +22",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -8"
      ],
      "+12": [
        "Защита +24",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -9"
      ],
      "+13": [
        "Защита +26",
        "Чем выше уровень усиления тем выше уровень поглощения.",
        "Шанс получить крит. удар -8",
        "Получаемый крит. урон -10"
      ]
    }
  },
  {
    "name": "Щит Ифрита",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+1": [
        "Защита +7",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+2": [
        "Защита +8",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+3": [
        "Защита +9",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+4": [
        "Защита +10",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1"
      ],
      "+5": [
        "Защита +11",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2"
      ],
      "+6": [
        "Защита +12",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3"
      ],
      "+7": [
        "Защита +14",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4"
      ],
      "+8": [
        "Защита +16",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5"
      ],
      "+9": [
        "Защита +18",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6"
      ],
      "+10": [
        "Защита +20",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -7"
      ],
      "+11": [
        "Защита +22",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -8"
      ],
      "+12": [
        "Защита +24",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -9"
      ],
      "+13": [
        "Защита +26",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -8",
        "Получаемый крит. урон -10"
      ]
    }
  },
  {
    "name": "Щит новичка",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +3",
        "HP +10"
      ]
    }
  },
  {
    "name": "Щит стража",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +5",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+1": [
        "Защита +6",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+2": [
        "Защита +7",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+3": [
        "Защита +8",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+4": [
        "Защита +9",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+5": [
        "Защита +10",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+6": [
        "Защита +11",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+7": [
        "Защита +13",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ],
      "+8": [
        "Защита +15",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ],
      "+9": [
        "Защита +17",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4"
      ],
      "+10": [
        "Защита +19",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4"
      ],
      "+11": [
        "Защита +21",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -5"
      ],
      "+12": [
        "Защита +23",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +25",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Щит стража (прок.)",
    "slot_code": "shield",
    "upgrade_levels": {
      "+0": [
        "Защита +5",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+1": [
        "Защита +6",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+2": [
        "Защита +7",
        "Чем выше уровень усиления, тем выше уровень уклонения."
      ],
      "+3": [
        "Защита +8",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+4": [
        "Защита +9",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -1"
      ],
      "+5": [
        "Защита +10",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+6": [
        "Защита +11",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -2"
      ],
      "+7": [
        "Защита +13",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ],
      "+8": [
        "Защита +15",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -3"
      ],
      "+9": [
        "Защита +17",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4"
      ],
      "+10": [
        "Защита +19",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -4"
      ],
      "+11": [
        "Защита +21",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -5"
      ],
      "+12": [
        "Защита +23",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +25",
        "Чем выше уровень усиления, тем выше уровень уклонения.",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Адские катары",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +24",
        "Убийца людей ур. 1"
      ],
      "+1": [
        "Шанс нанести крит. удар +27",
        "Убийца людей ур. 1"
      ],
      "+2": [
        "Шанс нанести крит. удар +30",
        "Убийца людей ур. 1"
      ],
      "+3": [
        "Шанс нанести крит. удар +33",
        "Убийца людей ур. 1"
      ],
      "+4": [
        "Шанс нанести крит. удар +36",
        "Убийца людей ур. 1"
      ],
      "+5": [
        "Шанс нанести крит. удар +39",
        "Убийца людей ур. 1"
      ],
      "+6": [
        "Шанс нанести крит. удар +42",
        "Убийца людей ур. 1"
      ],
      "+7": [
        "Шанс нанести крит. удар +45",
        "Убийца людей ур. 1"
      ],
      "+8": [
        "Шанс нанести крит. удар +48",
        "Убийца людей ур. 1"
      ],
      "+9": [
        "Шанс нанести крит. удар +51",
        "Убийца людей ур. 1"
      ],
      "+10": [
        "Шанс нанести крит. удар +54",
        "Убийца людей ур. 1"
      ],
      "+11": [
        "Шанс нанести крит. удар +57",
        "Убийца людей ур. 1"
      ],
      "+12": [
        "Шанс нанести крит. удар +60",
        "Убийца людей ур. 1"
      ],
      "+13": [
        "Шанс нанести крит. удар +63",
        "Убийца людей ур. 1"
      ]
    }
  },
  {
    "name": "Адский клинок",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Убийца людей ур. 1",
        "Скорость атаки +5%",
        "Шанс ядовитого удара +3%"
      ],
      "+1": [
        "Убийца людей ур. 1",
        "Скорость атаки +10%",
        "Шанс ядовитого удара +4%"
      ],
      "+2": [
        "Убийца людей ур. 1",
        "Скорость атаки +15%",
        "Шанс ядовитого удара +5%"
      ],
      "+3": [
        "Убийца людей ур. 1",
        "Скорость атаки +20%",
        "Шанс ядовитого удара +7%"
      ],
      "+4": [
        "Убийца людей ур. 1",
        "Скорость атаки +50%",
        "Шанс ядовитого удара +8%"
      ],
      "+5": [
        "Убийца людей ур. 1",
        "Скорость атаки +80%",
        "Шанс ядовитого удара +9%"
      ],
      "+6": [
        "Убийца людей ур. 1",
        "Скорость атаки +90%",
        "Шанс ядовитого удара +11%"
      ],
      "+7": [
        "Убийца людей ур. 1",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +12%"
      ],
      "+8": [
        "Убийца людей ур. 1",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +13%"
      ],
      "+9": [
        "Убийца людей ур. 1",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +15%"
      ],
      "+10": [
        "Убийца людей ур. 1",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +16%"
      ],
      "+11": [
        "Убийца людей ур. 1",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +17%"
      ],
      "+12": [
        "Убийца людей ур. 1",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +19%"
      ],
      "+13": [
        "Убийца людей ур. 1",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +20%"
      ]
    }
  },
  {
    "name": "Алебарда хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +1",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +1",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +1",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +1",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +1",
        "Уровень всех атак +1"
      ],
      "+5": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +1",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +3",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +5",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +7",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +9",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +11",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +13",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +15",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +18",
        "Уровень всех атак +8"
      ],
      "+14": [
        "Базовый урон 8",
        "Шанс нанести крит. удар +21",
        "Уровень всех атак +10"
      ]
    }
  },
  {
    "name": "Англахель",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7"
      ]
    }
  },
  {
    "name": "Аронди",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%"
      ]
    }
  },
  {
    "name": "Блестящий меч Солнца",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+1": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+2": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+3": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+4": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+5": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+6": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+7": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -12%"
      ],
      "+8": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -14%"
      ],
      "+9": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -16%"
      ],
      "+10": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -18%"
      ],
      "+11": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -20%"
      ],
      "+12": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -22%"
      ],
      "+13": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -24%"
      ]
    }
  },
  {
    "name": "Блестящий меч солнца (прок.)",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+1": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+2": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+3": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+4": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+5": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+6": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -10%"
      ],
      "+7": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -12%"
      ],
      "+8": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -14%"
      ],
      "+9": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -16%"
      ],
      "+10": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -18%"
      ],
      "+11": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -20%"
      ],
      "+12": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -22%"
      ],
      "+13": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Скорость атаки -24%"
      ]
    }
  },
  {
    "name": "Боевой топор",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Поглощение +2"
      ],
      "+1": [
        "Поглощение +2"
      ],
      "+2": [
        "Поглощение +2"
      ],
      "+3": [
        "Поглощение +3"
      ],
      "+4": [
        "Поглощение +3"
      ],
      "+5": [
        "Поглощение +4"
      ],
      "+6": [
        "Поглощение +4"
      ],
      "+7": [
        "Поглощение +5"
      ],
      "+8": [
        "Поглощение +5"
      ],
      "+9": [
        "Поглощение +6"
      ],
      "+10": [
        "Поглощение +6"
      ],
      "+11": [
        "Поглощение +7"
      ],
      "+12": [
        "Поглощение +7"
      ],
      "+13": [
        "Поглощение +7"
      ]
    }
  },
  {
    "name": "Бронебойное ружье",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 5.5",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ]
    }
  },
  {
    "name": "Вулканический мушкет Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Ловкость +1",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+1": [
        "Ловкость +1",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+2": [
        "Ловкость +2",
        "Проникающий урон +1",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+3": [
        "Ловкость +2",
        "Проникающий урон +1",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+4": [
        "Ловкость +3",
        "Проникающий урон +2",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+5": [
        "Ловкость +3",
        "Проникающий урон +2",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+6": [
        "Ловкость +4",
        "Проникающий урон +3",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+7": [
        "Ловкость +5",
        "Проникающий урон +3",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+8": [
        "Ловкость +6",
        "Проникающий урон +4",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+9": [
        "Ловкость +7",
        "Проникающий урон +4",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+10": [
        "Ловкость +8",
        "Проникающий урон +5",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+11": [
        "Ловкость +9",
        "Проникающий урон +5",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+12": [
        "Ловкость +10",
        "Проникающий урон +6",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ],
      "+13": [
        "Ловкость +11",
        "Проникающий урон +7",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ]
    }
  },
  {
    "name": "Громовое ружье",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 6",
        "Убийца людей ур. 2",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ]
    }
  },
  {
    "name": "Дамасская алебарда",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +10",
        "Могучая сила, ур. 1"
      ],
      "+1": [
        "Шанс нанести крит. удар +12",
        "Могучая сила, ур. 1"
      ],
      "+2": [
        "Шанс нанести крит. удар +14",
        "Могучая сила, ур. 1"
      ],
      "+3": [
        "Шанс нанести крит. удар +16",
        "Могучая сила, ур. 1"
      ],
      "+4": [
        "Шанс нанести крит. удар +18",
        "Могучая сила, ур. 2"
      ],
      "+5": [
        "Шанс нанести крит. удар +20",
        "Могучая сила, ур. 2"
      ],
      "+6": [
        "Шанс нанести крит. удар +22",
        "Могучая сила, ур. 2"
      ],
      "+7": [
        "Шанс нанести крит. удар +24",
        "Могучая сила, ур. 3"
      ],
      "+8": [
        "Шанс нанести крит. удар +26",
        "Могучая сила, ур. 4"
      ],
      "+9": [
        "Шанс нанести крит. удар +28",
        "Могучая сила, ур. 5"
      ],
      "+10": [
        "Шанс нанести крит. удар +30",
        "Могучая сила, ур. 6"
      ],
      "+11": [
        "Шанс нанести крит. удар +32",
        "Могучая сила, ур. 7"
      ],
      "+12": [
        "Шанс нанести крит. удар +34",
        "Могучая сила, ур. 8"
      ],
      "+13": [
        "Шанс нанести крит. удар +36",
        "Могучая сила, ур. 9"
      ]
    }
  },
  {
    "name": "Дамасская алебарда (прок.)",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +10",
        "Могучая сила, ур. 1"
      ],
      "+1": [
        "Шанс нанести крит. удар +12",
        "Могучая сила, ур. 1"
      ],
      "+2": [
        "Шанс нанести крит. удар +14",
        "Могучая сила, ур. 1"
      ],
      "+3": [
        "Шанс нанести крит. удар +16",
        "Могучая сила, ур. 1"
      ],
      "+4": [
        "Шанс нанести крит. удар +18",
        "Могучая сила, ур. 2"
      ],
      "+5": [
        "Шанс нанести крит. удар +20",
        "Могучая сила, ур. 2"
      ],
      "+6": [
        "Шанс нанести крит. удар +22",
        "Могучая сила, ур. 2"
      ],
      "+7": [
        "Шанс нанести крит. удар +24",
        "Могучая сила, ур. 3"
      ],
      "+8": [
        "Шанс нанести крит. удар +26",
        "Могучая сила, ур. 4"
      ],
      "+9": [
        "Шанс нанести крит. удар +28",
        "Могучая сила, ур. 5"
      ],
      "+10": [
        "Шанс нанести крит. удар +30",
        "Могучая сила, ур. 6"
      ],
      "+11": [
        "Шанс нанести крит. удар +32",
        "Могучая сила, ур. 7"
      ],
      "+12": [
        "Шанс нанести крит. удар +34",
        "Могучая сила, ур. 8"
      ],
      "+13": [
        "Шанс нанести крит. удар +36",
        "Могучая сила, ур. 9"
      ]
    }
  },
  {
    "name": "Двуручный меч",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Убийца людей ур. 2",
        "Поглощение +2"
      ],
      "+1": [
        "Убийца людей ур. 2",
        "Поглощение +2"
      ],
      "+2": [
        "Убийца людей ур. 2",
        "Поглощение +2"
      ],
      "+3": [
        "Убийца людей ур. 2",
        "Поглощение +3"
      ],
      "+4": [
        "Убийца людей ур. 2",
        "Поглощение +3"
      ],
      "+5": [
        "Убийца людей ур. 2",
        "Поглощение +4"
      ],
      "+6": [
        "Убийца людей ур. 2",
        "Поглощение +4"
      ],
      "+7": [
        "Убийца людей ур. 2",
        "Поглощение +5"
      ],
      "+8": [
        "Убийца людей ур. 2",
        "Поглощение +5"
      ],
      "+9": [
        "Убийца людей ур. 2",
        "Поглощение +6"
      ],
      "+10": [
        "Убийца людей ур. 2",
        "Поглощение +6"
      ],
      "+11": [
        "Убийца людей ур. 2",
        "Поглощение +7"
      ],
      "+12": [
        "Убийца людей ур. 2",
        "Поглощение +7"
      ],
      "+13": [
        "Убийца людей ур. 2",
        "Поглощение +7"
      ]
    }
  },
  {
    "name": "Двуручный меч хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 8",
        "Поглощение +2",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 8",
        "Поглощение +2",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 8",
        "Поглощение +3",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 8",
        "Поглощение +3",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 8",
        "Поглощение +3",
        "Уровень всех атак +1"
      ],
      "+5": [
        "Базовый урон 8",
        "Поглощение +3",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 8",
        "Поглощение +4",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 8",
        "Поглощение +4",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 8",
        "Поглощение +4",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 8",
        "Поглощение +4",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 8",
        "Поглощение +5",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 8",
        "Поглощение +5",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 8",
        "Поглощение +5",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 8",
        "Поглощение +5",
        "Уровень всех атак +8"
      ],
      "+14": [
        "Базовый урон 8",
        "Поглощение +6",
        "Уровень всех атак +10"
      ]
    }
  },
  {
    "name": "Джамадхары убийцы",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +27",
        "Убийца людей ур. 2"
      ],
      "+1": [
        "Шанс нанести крит. удар +30",
        "Убийца людей ур. 2"
      ],
      "+2": [
        "Шанс нанести крит. удар +33",
        "Убийца людей ур. 2"
      ],
      "+3": [
        "Шанс нанести крит. удар +36",
        "Убийца людей ур. 2"
      ],
      "+4": [
        "Шанс нанести крит. удар +39",
        "Убийца людей ур. 2"
      ],
      "+5": [
        "Шанс нанести крит. удар +42",
        "Убийца людей ур. 2"
      ],
      "+6": [
        "Шанс нанести крит. удар +45",
        "Убийца людей ур. 2"
      ],
      "+7": [
        "Шанс нанести крит. удар +48",
        "Убийца людей ур. 2"
      ],
      "+8": [
        "Шанс нанести крит. удар +51",
        "Убийца людей ур. 2"
      ],
      "+9": [
        "Шанс нанести крит. удар +54",
        "Убийца людей ур. 2"
      ],
      "+10": [
        "Шанс нанести крит. удар +57",
        "Убийца людей ур. 2"
      ],
      "+11": [
        "Шанс нанести крит. удар +60",
        "Убийца людей ур. 2"
      ],
      "+12": [
        "Шанс нанести крит. удар +63",
        "Убийца людей ур. 2"
      ],
      "+13": [
        "Шанс нанести крит. удар +66",
        "Убийца людей ур. 2"
      ]
    }
  },
  {
    "name": "Джамадхары убийцы (прок.)",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +27",
        "Убийца людей ур. 2"
      ],
      "+1": [
        "Шанс нанести крит. удар +30",
        "Убийца людей ур. 2"
      ],
      "+2": [
        "Шанс нанести крит. удар +33",
        "Убийца людей ур. 2"
      ],
      "+3": [
        "Шанс нанести крит. удар +36",
        "Убийца людей ур. 2"
      ],
      "+4": [
        "Шанс нанести крит. удар +39",
        "Убийца людей ур. 2"
      ],
      "+5": [
        "Шанс нанести крит. удар +42",
        "Убийца людей ур. 2"
      ],
      "+6": [
        "Шанс нанести крит. удар +45",
        "Убийца людей ур. 2"
      ],
      "+7": [
        "Шанс нанести крит. удар +48",
        "Убийца людей ур. 2"
      ],
      "+8": [
        "Шанс нанести крит. удар +51",
        "Убийца людей ур. 2"
      ],
      "+9": [
        "Шанс нанести крит. удар +54",
        "Убийца людей ур. 2"
      ],
      "+10": [
        "Шанс нанести крит. удар +57",
        "Убийца людей ур. 2"
      ],
      "+11": [
        "Шанс нанести крит. удар +60",
        "Убийца людей ур. 2"
      ],
      "+12": [
        "Шанс нанести крит. удар +63",
        "Убийца людей ур. 2"
      ],
      "+13": [
        "Шанс нанести крит. удар +66",
        "Убийца людей ур. 2"
      ]
    }
  },
  {
    "name": "Длинный лук ворона",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7.5"
      ],
      "+1": [
        "Базовый уровень атаки 7.5"
      ],
      "+2": [
        "Базовый уровень атаки 7.5"
      ],
      "+3": [
        "Базовый уровень атаки 7.5"
      ],
      "+4": [
        "Базовый уровень атаки 7.5"
      ],
      "+5": [
        "Базовый уровень атаки 7.5"
      ],
      "+6": [
        "Базовый уровень атаки 7.5"
      ],
      "+7": [
        "Базовый уровень атаки 7.5"
      ],
      "+8": [
        "Базовый уровень атаки 7.5"
      ],
      "+9": [
        "Базовый уровень атаки 7.5"
      ],
      "+10": [
        "Базовый уровень атаки 7.5"
      ],
      "+11": [
        "Базовый уровень атаки 7.5"
      ],
      "+12": [
        "Базовый уровень атаки 7.5"
      ],
      "+13": [
        "Базовый уровень атаки 7.5"
      ]
    }
  },
  {
    "name": "Железная алебарда",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +6"
      ],
      "+1": [
        "Шанс нанести крит. удар +8"
      ],
      "+2": [
        "Шанс нанести крит. удар +10"
      ],
      "+3": [
        "Шанс нанести крит. удар +12"
      ],
      "+4": [
        "Шанс нанести крит. удар +14"
      ],
      "+5": [
        "Шанс нанести крит. удар +16"
      ],
      "+6": [
        "Шанс нанести крит. удар +18"
      ],
      "+7": [
        "Шанс нанести крит. удар +20"
      ],
      "+8": [
        "Шанс нанести крит. удар +22"
      ],
      "+9": [
        "Шанс нанести крит. удар +24"
      ],
      "+10": [
        "Шанс нанести крит. удар +26"
      ],
      "+11": [
        "Шанс нанести крит. удар +28"
      ],
      "+12": [
        "Шанс нанести крит. удар +30"
      ],
      "+13": [
        "Шанс нанести крит. удар +32"
      ]
    }
  },
  {
    "name": "Карабин гномов",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7",
        "Убийца людей ур. 3",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ]
    }
  },
  {
    "name": "Катары хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +11",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +13",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +15",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +17",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +19",
        "Уровень всех атак +1"
      ],
      "+5": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +21",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +23",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +27",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +30",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +33",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +36",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +40",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +45",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +48",
        "Уровень всех атак +8"
      ],
      "+14": [
        "Базовый урон 7.5",
        "Шанс нанести крит. удар +52",
        "Уровень всех атак +10"
      ]
    }
  },
  {
    "name": "Клинок отражения",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Скорость атаки +5%",
        "Шанс ядовитого удара +2%"
      ],
      "+1": [
        "Скорость атаки +10%",
        "Шанс ядовитого удара +3%"
      ],
      "+2": [
        "Скорость атаки +15%",
        "Шанс ядовитого удара +4%"
      ],
      "+3": [
        "Скорость атаки +20%",
        "Шанс ядовитого удара +6%"
      ],
      "+4": [
        "Скорость атаки +50%",
        "Шанс ядовитого удара +7%"
      ],
      "+5": [
        "Скорость атаки +80%",
        "Шанс ядовитого удара +8%"
      ],
      "+6": [
        "Скорость атаки +90%",
        "Шанс ядовитого удара +10%"
      ],
      "+7": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +11%"
      ],
      "+8": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +12%"
      ],
      "+9": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +14%"
      ],
      "+10": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +15%"
      ],
      "+11": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +16%"
      ],
      "+12": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +18%"
      ],
      "+13": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +19%"
      ]
    }
  },
  {
    "name": "Клинок убийцы",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Убийца людей ур. 3",
        "Скорость атаки +5%",
        "Шанс ядовитого удара +5%"
      ],
      "+1": [
        "Убийца людей ур. 3",
        "Скорость атаки +10%",
        "Шанс ядовитого удара +6%"
      ],
      "+2": [
        "Убийца людей ур. 3",
        "Скорость атаки +15%",
        "Шанс ядовитого удара +7%"
      ],
      "+3": [
        "Убийца людей ур. 3",
        "Скорость атаки +20%",
        "Шанс ядовитого удара +9%"
      ],
      "+4": [
        "Убийца людей ур. 3",
        "Скорость атаки +50%",
        "Шанс ядовитого удара +10%"
      ],
      "+5": [
        "Убийца людей ур. 3",
        "Скорость атаки +80%",
        "Шанс ядовитого удара +11%"
      ],
      "+6": [
        "Убийца людей ур. 3",
        "Скорость атаки +90%",
        "Шанс ядовитого удара +13%"
      ],
      "+7": [
        "Убийца людей ур. 3",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +14%"
      ],
      "+8": [
        "Убийца людей ур. 3",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +15%"
      ],
      "+9": [
        "Убийца людей ур. 3",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +17%"
      ],
      "+10": [
        "Убийца людей ур. 3",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +18%"
      ],
      "+11": [
        "Убийца людей ур. 3",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +19%"
      ],
      "+12": [
        "Убийца людей ур. 3",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +21%"
      ],
      "+13": [
        "Убийца людей ур. 3",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +22%"
      ]
    }
  },
  {
    "name": "Клинок убийцы (прок.)",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": []
    }
  },
  {
    "name": "Клинок хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 5.5",
        "Скорость атаки +5%",
        "Шанс ядовитого удара +1%",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 5.5",
        "Скорость атаки +15%",
        "Шанс ядовитого удара +2%",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 5.5",
        "Скорость атаки +25%",
        "Шанс ядовитого удара +3%",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 5.5",
        "Скорость атаки +35%",
        "Шанс ядовитого удара +3%",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 5.5",
        "Скорость атаки +45%",
        "Шанс ядовитого удара +4%",
        "Уровень всех атак +1"
      ],
      "+5": [
        "Базовый урон 5.5",
        "Скорость атаки +55%",
        "Шанс ядовитого удара +4%",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 5.5",
        "Скорость атаки +65%",
        "Шанс ядовитого удара +5%",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 5.5",
        "Скорость атаки +70%",
        "Шанс ядовитого удара +6%",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 5.5",
        "Скорость атаки +75%",
        "Шанс ядовитого удара +7%",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 5.5",
        "Скорость атаки +80%",
        "Шанс ядовитого удара +8%",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 5.5",
        "Скорость атаки +85%",
        "Шанс ядовитого удара +9%",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 5.5",
        "Скорость атаки +90%",
        "Шанс ядовитого удара +10%",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 5.5",
        "Скорость атаки +95%",
        "Шанс ядовитого удара +11%",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 5.5",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +12%",
        "Уровень всех атак +8"
      ],
      "+14": [
        "Базовый урон 5.5",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +14%",
        "Уровень всех атак +10"
      ]
    }
  },
  {
    "name": "Композитный лук",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 8",
        "Убийца людей ур. 3"
      ]
    }
  },
  {
    "name": "Композитный лук (прок.)",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 8",
        "Убийца людей ур. 3"
      ]
    }
  },
  {
    "name": "Копье гвардейца",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +2"
      ],
      "+1": [
        "Шанс нанести крит. удар +4"
      ],
      "+2": [
        "Шанс нанести крит. удар +6"
      ],
      "+3": [
        "Шанс нанести крит. удар +8"
      ],
      "+4": [
        "Шанс нанести крит. удар +10"
      ],
      "+5": [
        "Шанс нанести крит. удар +12"
      ],
      "+6": [
        "Шанс нанести крит. удар +14"
      ],
      "+7": [
        "Шанс нанести крит. удар +16"
      ],
      "+8": [
        "Шанс нанести крит. удар +18"
      ],
      "+9": [
        "Шанс нанести крит. удар +20"
      ],
      "+10": [
        "Шанс нанести крит. удар +22"
      ],
      "+11": [
        "Шанс нанести крит. удар +24"
      ],
      "+12": [
        "Шанс нанести крит. удар +26"
      ],
      "+13": [
        "Шанс нанести крит. удар +28"
      ]
    }
  },
  {
    "name": "Кремниевое ружье",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7",
        "Убийца людей ур. 2",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ]
    }
  },
  {
    "name": "Крис",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Убийца людей ур. 2",
        "Скорость атаки +5%",
        "Шанс ядовитого удара +4%"
      ],
      "+1": [
        "Убийца людей ур. 2",
        "Скорость атаки +10%",
        "Шанс ядовитого удара +5%"
      ],
      "+2": [
        "Убийца людей ур. 2",
        "Скорость атаки +15%",
        "Шанс ядовитого удара +6%"
      ],
      "+3": [
        "Убийца людей ур. 2",
        "Скорость атаки +20%",
        "Шанс ядовитого удара +8%"
      ],
      "+4": [
        "Убийца людей ур. 2",
        "Скорость атаки +50%",
        "Шанс ядовитого удара +9%"
      ],
      "+5": [
        "Убийца людей ур. 2",
        "Скорость атаки +80%",
        "Шанс ядовитого удара +10%"
      ],
      "+6": [
        "Убийца людей ур. 2",
        "Скорость атаки +90%",
        "Шанс ядовитого удара +12%"
      ],
      "+7": [
        "Убийца людей ур. 2",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +13%"
      ],
      "+8": [
        "Убийца людей ур. 2",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +14%"
      ],
      "+9": [
        "Убийца людей ур. 2",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +16%"
      ],
      "+10": [
        "Убийца людей ур. 2",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +17%"
      ],
      "+11": [
        "Убийца людей ур. 2",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +18%"
      ],
      "+12": [
        "Убийца людей ур. 2",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +20%"
      ],
      "+13": [
        "Убийца людей ур. 2",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +21%"
      ]
    }
  },
  {
    "name": "Кровавые джамадхары",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +21"
      ],
      "+1": [
        "Шанс нанести крит. удар +24"
      ],
      "+2": [
        "Шанс нанести крит. удар +27"
      ],
      "+3": [
        "Шанс нанести крит. удар +30"
      ],
      "+4": [
        "Шанс нанести крит. удар +33"
      ],
      "+5": [
        "Шанс нанести крит. удар +36"
      ],
      "+6": [
        "Шанс нанести крит. удар +39"
      ],
      "+7": [
        "Шанс нанести крит. удар +42"
      ],
      "+8": [
        "Шанс нанести крит. удар +45"
      ],
      "+9": [
        "Шанс нанести крит. удар +48"
      ],
      "+10": [
        "Шанс нанести крит. удар +51"
      ],
      "+11": [
        "Шанс нанести крит. удар +54"
      ],
      "+12": [
        "Шанс нанести крит. удар +57"
      ],
      "+13": [
        "Шанс нанести крит. удар +60"
      ]
    }
  },
  {
    "name": "Кровавый клинок",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Скорость атаки +5%",
        "Шанс ядовитого удара +1%"
      ],
      "+1": [
        "Скорость атаки +10%",
        "Шанс ядовитого удара +2%"
      ],
      "+2": [
        "Скорость атаки +15%",
        "Шанс ядовитого удара +3%"
      ],
      "+3": [
        "Скорость атаки +20%",
        "Шанс ядовитого удара +5%"
      ],
      "+4": [
        "Скорость атаки +50%",
        "Шанс ядовитого удара +6%"
      ],
      "+5": [
        "Скорость атаки +80%",
        "Шанс ядовитого удара +7%"
      ],
      "+6": [
        "Скорость атаки +90%",
        "Шанс ядовитого удара +9%"
      ],
      "+7": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +10%"
      ],
      "+8": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +11%"
      ],
      "+9": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +13%"
      ],
      "+10": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +14%"
      ],
      "+11": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +15%"
      ],
      "+12": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +17%"
      ],
      "+13": [
        "Скорость атаки +100%",
        "Шанс ядовитого удара +18%"
      ]
    }
  },
  {
    "name": "Лук гнома",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 8"
      ]
    }
  },
  {
    "name": "Лук кочевника",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 3"
      ]
    }
  },
  {
    "name": "Лук хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+5": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 8",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 8",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 8",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 8",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 8",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 8",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 8",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 8",
        "Уровень всех атак +8"
      ],
      "+14": [
        "Базовый урон 8",
        "Уровень всех атак +10"
      ]
    }
  },
  {
    "name": "Магмовый орб Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +1"
      ],
      "+1": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +1"
      ],
      "+2": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +2",
        "Проникающий урон +1"
      ],
      "+3": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +2",
        "Проникающий урон +1"
      ],
      "+4": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +3",
        "Проникающий урон +2"
      ],
      "+5": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +3",
        "Проникающий урон +2"
      ],
      "+6": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +4",
        "Проникающий урон +3"
      ],
      "+7": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +5",
        "Проникающий урон +3"
      ],
      "+8": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +6",
        "Проникающий урон +4"
      ],
      "+9": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +7",
        "Проникающий урон +4"
      ],
      "+10": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +8",
        "Проникающий урон +5"
      ],
      "+11": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +9",
        "Проникающий урон +5"
      ],
      "+12": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +10",
        "Проникающий урон +6"
      ],
      "+13": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Ловкость +11",
        "Проникающий урон +7"
      ]
    }
  },
  {
    "name": "Меч Правосудия",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Убийца людей ур. 3",
        "Поглощение +2"
      ],
      "+1": [
        "Убийца людей ур. 3",
        "Поглощение +2"
      ],
      "+2": [
        "Убийца людей ур. 3",
        "Поглощение +2"
      ],
      "+3": [
        "Убийца людей ур. 3",
        "Поглощение +3"
      ],
      "+4": [
        "Убийца людей ур. 3",
        "Поглощение +3"
      ],
      "+5": [
        "Убийца людей ур. 3",
        "Поглощение +4"
      ],
      "+6": [
        "Убийца людей ур. 3",
        "Поглощение +4"
      ],
      "+7": [
        "Убийца людей ур. 3",
        "Поглощение +5"
      ],
      "+8": [
        "Убийца людей ур. 3",
        "Поглощение +5"
      ],
      "+9": [
        "Убийца людей ур. 3",
        "Поглощение +6"
      ],
      "+10": [
        "Убийца людей ур. 3",
        "Поглощение +6"
      ],
      "+11": [
        "Убийца людей ур. 3",
        "Поглощение +7"
      ],
      "+12": [
        "Убийца людей ур. 3",
        "Поглощение +7"
      ],
      "+13": [
        "Убийца людей ур. 3",
        "Поглощение +7"
      ]
    }
  },
  {
    "name": "Меч жреца",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 9",
        "Убийца людей ур. 3"
      ]
    }
  },
  {
    "name": "Меч жреца (прок.)",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 9",
        "Убийца людей ур. 3"
      ]
    }
  },
  {
    "name": "Меч кочевника",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 4.5"
      ]
    }
  },
  {
    "name": "Меч лунного света",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -3"
      ],
      "+1": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -3"
      ],
      "+2": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -3"
      ],
      "+3": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -3"
      ],
      "+4": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -3"
      ],
      "+5": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -3"
      ],
      "+6": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -3"
      ],
      "+7": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -6"
      ],
      "+8": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -6"
      ],
      "+9": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -6"
      ],
      "+10": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -9"
      ],
      "+11": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -9"
      ],
      "+12": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -9"
      ],
      "+13": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Точность -12"
      ]
    }
  },
  {
    "name": "Меч точности Рарки",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект: Все параметры -1"
      ],
      "+1": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Все параметры -1"
      ],
      "+2": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Все параметры -1"
      ],
      "+3": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Все параметры -1"
      ],
      "+4": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Сила -1",
        "Ловкость-2",
        "Интеллект -2"
      ],
      "+5": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Сила -1",
        "Ловкость-2",
        "Интеллект -2"
      ],
      "+6": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Сила -1",
        "Ловкость-2",
        "Интеллект -2"
      ],
      "+7": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Все параметры -2"
      ],
      "+8": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Сила -2",
        "Ловкость-3",
        "Интеллект -3"
      ],
      "+9": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Все параметры -3"
      ],
      "+10": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Сила -3",
        "Ловкость-4",
        "Интеллект -4"
      ],
      "+11": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Все параметры -4"
      ],
      "+12": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Сила -4",
        "Ловкость-5",
        "Интеллект -5"
      ],
      "+13": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Может наложить на цель эффект:",
        "Все параметры -5"
      ]
    }
  },
  {
    "name": "Меч хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +1"
      ],
      "+5": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +8"
      ],
      "+14": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Уровень всех атак +10"
      ]
    }
  },
  {
    "name": "Морглай",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Поглощение +2"
      ],
      "+1": [
        "Поглощение +2"
      ],
      "+2": [
        "Поглощение +2"
      ],
      "+3": [
        "Поглощение +3"
      ],
      "+4": [
        "Поглощение +3"
      ],
      "+5": [
        "Поглощение +4"
      ],
      "+6": [
        "Поглощение +4"
      ],
      "+7": [
        "Поглощение +5"
      ],
      "+8": [
        "Поглощение +5"
      ],
      "+9": [
        "Поглощение +6"
      ],
      "+10": [
        "Поглощение +6"
      ],
      "+11": [
        "Поглощение +7"
      ],
      "+12": [
        "Поглощение +7"
      ],
      "+13": [
        "Поглощение +7"
      ]
    }
  },
  {
    "name": "Начальный клинок ассасина",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 3.5"
      ]
    }
  },
  {
    "name": "Начальный лук рейнджера",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 5.5"
      ]
    }
  },
  {
    "name": "Начальный меч мага",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 5.5"
      ]
    }
  },
  {
    "name": "Начальный меч рыцаря",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 6.5"
      ]
    }
  },
  {
    "name": "Начальный орб призывателя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 5"
      ]
    }
  },
  {
    "name": "Начальный посох мага",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 5"
      ]
    }
  },
  {
    "name": "Огневой лук Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Ловкость +1"
      ],
      "+1": [
        "Ловкость +1"
      ],
      "+2": [
        "Ловкость +2",
        "Проникающий урон +1"
      ],
      "+3": [
        "Ловкость +2",
        "Проникающий урон +1"
      ],
      "+4": [
        "Ловкость +3",
        "Проникающий урон +2"
      ],
      "+5": [
        "Ловкость +3",
        "Проникающий урон +2"
      ],
      "+6": [
        "Ловкость +4",
        "Проникающий урон +3"
      ],
      "+7": [
        "Ловкость +5",
        "Проникающий урон +3"
      ],
      "+8": [
        "Ловкость +6",
        "Проникающий урон +4"
      ],
      "+9": [
        "Ловкость +7",
        "Проникающий урон +4"
      ],
      "+10": [
        "Ловкость +8",
        "Проникающий урон +5"
      ],
      "+11": [
        "Ловкость +9",
        "Проникающий урон +5"
      ],
      "+12": [
        "Ловкость +10",
        "Проникающий урон +6"
      ],
      "+13": [
        "Ловкость +11",
        "Проникающий урон +7"
      ]
    }
  },
  {
    "name": "Огненные катары Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +30",
        "Сила +1"
      ],
      "+1": [
        "Шанс нанести крит. удар +33",
        "Сила +1"
      ],
      "+2": [
        "Шанс нанести крит. удар +36",
        "Сила +2",
        "Проникающий урон +1"
      ],
      "+3": [
        "Шанс нанести крит. удар +39",
        "Сила +2",
        "Проникающий урон +1"
      ],
      "+4": [
        "Шанс нанести крит. удар +42",
        "Сила +3",
        "Проникающий урон +2"
      ],
      "+5": [
        "Шанс нанести крит. удар +45",
        "Сила +3",
        "Проникающий урон +2"
      ],
      "+6": [
        "Шанс нанести крит. удар +48",
        "Сила +4",
        "Проникающий урон +3"
      ],
      "+7": [
        "Шанс нанести крит. удар +51",
        "Сила +5",
        "Проникающий урон +3"
      ],
      "+8": [
        "Шанс нанести крит. удар +54",
        "Сила +6",
        "Проникающий урон +4"
      ],
      "+9": [
        "Шанс нанести крит. удар +57",
        "Сила +7",
        "Проникающий урон +4"
      ],
      "+10": [
        "Шанс нанести крит. удар +60",
        "Сила +8",
        "Проникающий урон +5"
      ],
      "+11": [
        "Шанс нанести крит. удар +63",
        "Сила +9",
        "Проникающий урон +5"
      ],
      "+12": [
        "Шанс нанести крит. удар +66",
        "Сила +10",
        "Проникающий урон +6"
      ],
      "+13": [
        "Шанс нанести крит. удар +69",
        "Сила +11",
        "Проникающий урон +7"
      ]
    }
  },
  {
    "name": "Огненный клеймор Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Сила +1"
      ],
      "+1": [
        "Сила +1"
      ],
      "+2": [
        "Сила +2",
        "Проникающий урон +1"
      ],
      "+3": [
        "Сила +2",
        "Проникающий урон +1"
      ],
      "+4": [
        "Сила +3",
        "Проникающий урон +2"
      ],
      "+5": [
        "Сила +3",
        "Проникающий урон +2"
      ],
      "+6": [
        "Сила +4",
        "Проникающий урон +3"
      ],
      "+7": [
        "Сила +5",
        "Проникающий урон +3"
      ],
      "+8": [
        "Сила +6",
        "Проникающий урон +4"
      ],
      "+9": [
        "Сила +7",
        "Проникающий урон +4"
      ],
      "+10": [
        "Сила +8",
        "Проникающий урон +5"
      ],
      "+11": [
        "Сила +9",
        "Проникающий урон +5"
      ],
      "+12": [
        "Сила +10",
        "Проникающий урон +6"
      ],
      "+13": [
        "Сила +11",
        "Проникающий урон +7"
      ]
    }
  },
  {
    "name": "Орб Зефироса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 8",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Убийца людей ур. 1"
      ]
    }
  },
  {
    "name": "Орб Юпитера",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 8.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Убийца людей ур. 1"
      ]
    }
  },
  {
    "name": "Орб воды",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 9",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Убийца людей ур. 2"
      ]
    }
  },
  {
    "name": "Орб воды (прок.)",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 9",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Убийца людей ур. 2"
      ]
    }
  },
  {
    "name": "Орб души Гайи",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 6.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки."
      ]
    }
  },
  {
    "name": "Орб кочевника",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 3"
      ]
    }
  },
  {
    "name": "Орб призывателя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки."
      ]
    }
  },
  {
    "name": "Орб хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +1"
      ],
      "+5": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +8"
      ],
      "+14": [
        "Базовый урон 7.5",
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Уровень всех атак +10"
      ]
    }
  },
  {
    "name": "Охотничий лук",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7"
      ]
    }
  },
  {
    "name": "Пламенная рапира Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +1",
        "Может наложить на цель эффект:",
        "Ожог (-10 HP в секунду)"
      ],
      "+1": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +1",
        "Может наложить на цель эффект:",
        "Ожог (-10 HP в секунду)"
      ],
      "+2": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +2",
        "Проникающий урон +1",
        "Может наложить на цель эффект:",
        "Ожог (-15 HP в секунду)"
      ],
      "+3": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +2",
        "Проникающий урон +1",
        "Может наложить на цель эффект:",
        "Ожог (-15 HP в секунду)"
      ],
      "+4": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +3",
        "Проникающий урон +2",
        "Может наложить на цель эффект:",
        "Ожог (-20 HP в секунду)"
      ],
      "+5": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +3",
        "Проникающий урон +2",
        "Может наложить на цель эффект:",
        "Ожог (-25 HP в секунду)"
      ],
      "+6": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +4",
        "Проникающий урон +3",
        "Может наложить на цель эффект:",
        "Ожог (-30 HP в секунду)"
      ],
      "+7": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +5",
        "Проникающий урон +3",
        "Может наложить на цель эффект:",
        "Ожог (-35 HP в секунду)"
      ],
      "+8": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +6",
        "Проникающий урон +4",
        "Может наложить на цель эффект:",
        "Ожог (-40 HP в секунду)"
      ],
      "+9": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +7",
        "Проникающий урон +4",
        "Может наложить на цель эффект:",
        "Ожог (-45 HP в секунду)"
      ],
      "+10": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +8",
        "Проникающий урон +5",
        "Может наложить на цель эффект:",
        "Ожог (-50 HP в секунду)"
      ],
      "+11": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +9",
        "Проникающий урон +5",
        "Может наложить на цель эффект:",
        "Ожог (-55 HP в секунду)"
      ],
      "+12": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +10",
        "Проникающий урон +6",
        "Может наложить на цель эффект:",
        "Ожог (-60 HP в секунду)"
      ],
      "+13": [
        "Чем выше уровень усиления, тем выше уровень магической атаки.",
        "Скорость атаки +20%",
        "Сила +11",
        "Проникающий урон +7",
        "Может наложить на цель эффект:",
        "Ожог (-65 HP в секунду)"
      ]
    }
  },
  {
    "name": "Посох Аллатариэль",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7",
        "Убийца людей ур. 1"
      ]
    }
  },
  {
    "name": "Посох Литейн",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 6"
      ]
    }
  },
  {
    "name": "Посох Югенеса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7.5",
        "Убийца людей ур. 1"
      ]
    }
  },
  {
    "name": "Посох кочевника",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 3"
      ]
    }
  },
  {
    "name": "Пылающий двуручный меч Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Поглощение +2",
        "Сила+1"
      ],
      "+1": [
        "Поглощение +2",
        "Сила +1"
      ],
      "+2": [
        "Поглощение +2",
        "Сила +2",
        "Проникающий урон +1"
      ],
      "+3": [
        "Поглощение +4",
        "Сила +2",
        "Проникающий урон +1"
      ],
      "+4": [
        "Поглощение +4",
        "Сила +3",
        "Проникающий урон +2"
      ],
      "+5": [
        "Поглощение +6",
        "Сила +3",
        "Проникающий урон +2"
      ],
      "+6": [
        "Поглощение +6",
        "Сила +4",
        "Проникающий урон +3"
      ],
      "+7": [
        "Поглощение +7",
        "Сила +5",
        "Проникающий урон +3"
      ],
      "+8": [
        "Поглощение +7",
        "Сила +6",
        "Проникающий урон +4"
      ],
      "+9": [
        "Поглощение +7",
        "Сила +7",
        "Проникающий урон +4"
      ],
      "+10": [
        "Поглощение +7",
        "Сила +8",
        "Проникающий урон +5"
      ],
      "+11": [
        "Поглощение +9",
        "Сила +9",
        "Проникающий урон +5"
      ],
      "+12": [
        "Поглощение +9",
        "Сила +10",
        "Проникающий урон +6"
      ],
      "+13": [
        "Поглощение +9",
        "Сила +11",
        "Проникающий урон +7"
      ]
    }
  },
  {
    "name": "Раскаленный ятаган Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Сила +1",
        "Скорость атаки +5%",
        "Шанс ядовитого удара +6%"
      ],
      "+1": [
        "Сила +1",
        "Скорость атаки +10%",
        "Шанс ядовитого удара +7%"
      ],
      "+2": [
        "Сила +2",
        "Проникающий урон +1",
        "Скорость атаки +15%",
        "Шанс ядовитого удара +8%"
      ],
      "+3": [
        "Сила +2",
        "Проникающий урон +1",
        "Скорость атаки +20%",
        "Шанс ядовитого удара +10%"
      ],
      "+4": [
        "Сила +3",
        "Проникающий урон +2",
        "Скорость атаки +50%",
        "Шанс ядовитого удара +11%"
      ],
      "+5": [
        "Сила +3",
        "Проникающий урон +2",
        "Скорость атаки +80%",
        "Шанс ядовитого удара +12%"
      ],
      "+6": [
        "Сила +4",
        "Проникающий урон +3",
        "Скорость атаки +90%",
        "Шанс ядовитого удара +14%"
      ],
      "+7": [
        "Сила +5",
        "Проникающий урон +3",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +15%"
      ],
      "+8": [
        "Сила +6",
        "Проникающий урон +4",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +16%"
      ],
      "+9": [
        "Сила +7",
        "Проникающий урон +4",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +18%"
      ],
      "+10": [
        "Сила +8",
        "Проникающий урон +5",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +19%"
      ],
      "+11": [
        "Сила +9",
        "Проникающий урон +5",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +20%"
      ],
      "+12": [
        "Сила +10",
        "Проникающий урон +6",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +22%"
      ],
      "+13": [
        "Сила +11",
        "Проникающий урон +7",
        "Скорость атаки +100%",
        "Шанс ядовитого удара +23%"
      ]
    }
  },
  {
    "name": "Ружье хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 7",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 7",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 7",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 7",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 7",
        "Уровень всех атак +1"
      ],
      "+5": [
        "Базовый урон 7",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 7",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 7",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 7",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 7",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 7",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 7",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 7",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 7",
        "Уровень всех атак +8"
      ],
      "+14": [
        "Базовый урон 7",
        "Уровень всех атак +10"
      ]
    }
  },
  {
    "name": "Сабля хранителя",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+1": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+2": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+3": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+4": [
        "Базовый урон 8",
        "Уровень всех атак +10"
      ],
      "+5": [
        "Базовый урон 8",
        "Уровень всех атак +1"
      ],
      "+6": [
        "Базовый урон 8",
        "Уровень всех атак +2"
      ],
      "+7": [
        "Базовый урон 8",
        "Уровень всех атак +2"
      ],
      "+8": [
        "Базовый урон 8",
        "Уровень всех атак +3"
      ],
      "+9": [
        "Базовый урон 8",
        "Уровень всех атак +3"
      ],
      "+10": [
        "Базовый урон 8",
        "Уровень всех атак +4"
      ],
      "+11": [
        "Базовый урон 8",
        "Уровень всех атак +5"
      ],
      "+12": [
        "Базовый урон 8",
        "Уровень всех атак +6"
      ],
      "+13": [
        "Базовый урон 8",
        "Уровень всех атак +8"
      ]
    }
  },
  {
    "name": "Священный скипетр Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Интеллект +1"
      ],
      "+1": [
        "Интеллект +1"
      ],
      "+2": [
        "Интеллект +2",
        "Проникающий урон +1"
      ],
      "+3": [
        "Интеллект +2",
        "Проникающий урон +1"
      ],
      "+4": [
        "Интеллект +3",
        "Проникающий урон +2"
      ],
      "+5": [
        "Интеллект +3",
        "Проникающий урон +2"
      ],
      "+6": [
        "Интеллект +4",
        "Проникающий урон +3"
      ],
      "+7": [
        "Интеллект +5",
        "Проникающий урон +3"
      ],
      "+8": [
        "Интеллект +6",
        "Проникающий урон +4"
      ],
      "+9": [
        "Интеллект +7",
        "Проникающий урон +4"
      ],
      "+10": [
        "Интеллект +8",
        "Проникающий урон +5"
      ],
      "+11": [
        "Интеллект +9",
        "Проникающий урон +5"
      ],
      "+12": [
        "Интеллект +10",
        "Проникающий урон +6"
      ],
      "+13": [
        "Интеллект +11",
        "Проникающий урон +7"
      ]
    }
  },
  {
    "name": "Скипетр Мудрости",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 5"
      ]
    }
  },
  {
    "name": "Скипетр жреца",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 8",
        "Убийца людей ур.2"
      ]
    }
  },
  {
    "name": "Слэшер",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Убийца людей ур. 3",
        "Поглощение +2"
      ],
      "+1": [
        "Убийца людей ур. 3",
        "Поглощение +2"
      ],
      "+2": [
        "Убийца людей ур. 3",
        "Поглощение +2"
      ],
      "+3": [
        "Убийца людей ур. 3",
        "Поглощение +4"
      ],
      "+4": [
        "Убийца людей ур. 3",
        "Поглощение +4"
      ],
      "+5": [
        "Убийца людей ур. 3",
        "Поглощение +5"
      ],
      "+6": [
        "Убийца людей ур. 3",
        "Поглощение +5"
      ],
      "+7": [
        "Убийца людей ур. 3",
        "Поглощение +6"
      ],
      "+8": [
        "Убийца людей ур. 3",
        "Поглощение +6"
      ],
      "+9": [
        "Убийца людей ур. 3",
        "Поглощение +7"
      ],
      "+10": [
        "Убийца людей ур. 3",
        "Поглощение +7"
      ],
      "+11": [
        "Убийца людей ур. 3",
        "Поглощение +8"
      ],
      "+12": [
        "Убийца людей ур. 3",
        "Поглощение +8"
      ],
      "+13": [
        "Убийца людей ур. 3",
        "Поглощение +8"
      ]
    }
  },
  {
    "name": "Слэшер (прок.)",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Огромный и тяжелый меч, который наносит значительный урон.",
        "Базовый уровень атаки 9",
        "Убийца людей ур. 3",
        "Поглощение +2"
      ]
    }
  },
  {
    "name": "Стальная алебарда Метеоса",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Шанс нанести крит. удар +12",
        "Сила +1"
      ],
      "+1": [
        "Шанс нанести крит. удар +14",
        "Сила +1"
      ],
      "+2": [
        "Шанс нанести крит. удар +16",
        "Сила +2",
        "Проникающий урон +1"
      ],
      "+3": [
        "Шанс нанести крит. удар +18",
        "Сила +2",
        "Проникающий урон +1"
      ],
      "+4": [
        "Шанс нанести крит. удар +20",
        "Сила +3",
        "Проникающий урон +2"
      ],
      "+5": [
        "Шанс нанести крит. удар +22",
        "Сила +3",
        "Проникающий урон +2"
      ],
      "+6": [
        "Шанс нанести крит. удар +24",
        "Сила +4",
        "Проникающий урон +3"
      ],
      "+7": [
        "Шанс нанести крит. удар +26",
        "Сила +5",
        "Проникающий урон +3"
      ],
      "+8": [
        "Шанс нанести крит. удар +28",
        "Сила +6",
        "Проникающий урон +4"
      ],
      "+9": [
        "Шанс нанести крит. удар +30",
        "Сила +7",
        "Проникающий урон +4"
      ],
      "+10": [
        "Шанс нанести крит. удар +32",
        "Сила +8",
        "Проникающий урон +5"
      ],
      "+11": [
        "Шанс нанести крит. удар +34",
        "Сила +9",
        "Проникающий урон +5"
      ],
      "+12": [
        "Шанс нанести крит. удар +36",
        "Сила +10",
        "Проникающий урон +6"
      ],
      "+13": [
        "Шанс нанести крит. удар +38",
        "Сила +11",
        "Проникающий урон +7"
      ]
    }
  },
  {
    "name": "Стальное ружье",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 5",
        "Увеличивает параметры МКБ в зависимости от уровня усиления оружия."
      ]
    }
  },
  {
    "name": "Хитиновая сабля",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [],
      "+1": [],
      "+2": [],
      "+3": [],
      "+4": [],
      "+5": [],
      "+6": [],
      "+7": [],
      "+8": [],
      "+9": []
    }
  },
  {
    "name": "Эльфийский лук",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 7.5",
        "Убийца людей ур. 2"
      ]
    }
  },
  {
    "name": "Эльфийский меч",
    "slot_code": "weapon",
    "upgrade_levels": {
      "+0": [
        "Базовый уровень атаки 8",
        "Убийца людей ур. 2"
      ]
    }
  },
  {
    "name": "Блестящий ремень интеллекта",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, увеличивающий интеллект.",
        "Точность магических атак +1",
        "Интеллект +3"
      ]
    }
  },
  {
    "name": "Блестящий ремень ловкости",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, повышающий ловкость.",
        "Точность дальних атак +1",
        "Ловкость +3"
      ]
    }
  },
  {
    "name": "Блестящий ремень силы",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Точность ближних атак +1",
        "Сила +3"
      ]
    }
  },
  {
    "name": "Ледяной ремень",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уклонение +4"
      ]
    }
  },
  {
    "name": "Ремень берсерка",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Сила +3",
        "Уровень ближних атак +3",
        "Точность ближних атак +1",
        "Вес +1000"
      ],
      "+1": [
        "Сила +4",
        "Уровень ближних атак +3",
        "Точность ближних атак +1",
        "Вес +1250"
      ],
      "+2": [
        "Сила +5",
        "Уровень ближних атак +4",
        "Точность ближних атак +1",
        "Вес +1500"
      ],
      "+3": [
        "Сила +6",
        "Уровень ближних атак +5",
        "Точность ближних атак +2",
        "Вес +1750"
      ],
      "+4": [
        "Сила +7",
        "Уровень ближних атак +6",
        "Точность ближних атак +2",
        "Вес +2000"
      ],
      "+5": [
        "Сила +8",
        "Уровень ближних атак +7",
        "Точность ближних атак +3",
        "Вес +2250"
      ]
    }
  },
  {
    "name": "Ремень беспощадной расправы",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4"
      ]
    }
  },
  {
    "name": "Ремень божественного поглощения",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, увеличивающий поглощение от атак противника.",
        "Поглощение +2"
      ]
    }
  },
  {
    "name": "Ремень воздуха",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +1",
        "Вес +1000"
      ]
    }
  },
  {
    "name": "Ремень восстановления",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,1",
        "Восстановление MP +0,1",
        "Вес +400"
      ]
    }
  },
  {
    "name": "Ремень выживания",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "HP +30",
        "MP +15",
        "Вес +400"
      ]
    }
  },
  {
    "name": "Ремень высокого интеллекта",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, увеличивающий интеллект.",
        "Уровень магических атак +1",
        "Точность магических атак +1",
        "Интеллект +3"
      ]
    }
  },
  {
    "name": "Ремень высокой ловкости",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, повышающий ловкость.",
        "Уровень дальних атак +1",
        "Точность дальних атак +1",
        "Ловкость +3"
      ]
    }
  },
  {
    "name": "Ремень высокой силы",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень ближних атак +1",
        "Точность ближних атак +1",
        "Сила +3"
      ]
    }
  },
  {
    "name": "Ремень гладиатора",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уклонение +4",
        "HP+50",
        "MP+25",
        "Получаемый крит. урон -2"
      ],
      "+1": [
        "Уклонение +5",
        "HP+100",
        "MP+50",
        "Получаемый крит. урон -4"
      ],
      "+2": [
        "Уклонение +6",
        "HP+200",
        "MP+100",
        "Получаемый крит. урон -6"
      ],
      "+3": [
        "Уклонение +7",
        "HP+250",
        "MP+125",
        "Получаемый крит. урон -8"
      ],
      "+4": [
        "Уклонение +8",
        "HP+350",
        "MP+175",
        "Получаемый крит. урон -10"
      ],
      "+5": [
        "Уклонение +9",
        "HP+400",
        "MP+200",
        "Получаемый крит. урон -12"
      ]
    }
  },
  {
    "name": "Ремень головореза",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ловкость +3",
        "Уровень дальних атак +3",
        "Точность дальних атак +1",
        "Вес +1000"
      ],
      "+1": [
        "Ловкость +4",
        "Уровень дальних атак +3",
        "Точность дальних атак +1",
        "Вес +1250"
      ],
      "+2": [
        "Ловкость +5",
        "Уровень дальних атак +4",
        "Точность дальних атак +1",
        "Вес +1500"
      ],
      "+3": [
        "Ловкость +6",
        "Уровень дальних атак +5",
        "Точность дальних атак +2",
        "Вес +1750"
      ],
      "+4": [
        "Ловкость +7",
        "Уровень дальних атак +6",
        "Точность дальних атак +2",
        "Вес +2000"
      ],
      "+5": [
        "Ловкость +8",
        "Уровень дальних атак +7",
        "Точность дальних атак +3",
        "Вес +2250"
      ]
    }
  },
  {
    "name": "Ремень жестокой расправы",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +2",
        "Шанс нанести крит. удар +2",
        "Доп. урон при крит. ударе +2"
      ]
    }
  },
  {
    "name": "Ремень земли",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +1",
        "Вес +1000"
      ]
    }
  },
  {
    "name": "Ремень интеллекта",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Пояс, повышающий интеллект.",
        "Интеллект +1"
      ]
    }
  },
  {
    "name": "Ремень карателя",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Сила +3",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "Вес +1000"
      ],
      "+1": [
        "Сила +4",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "Вес +1250"
      ],
      "+2": [
        "Сила +4",
        "Точность ближних атак +4",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +7",
        "Вес +1500"
      ],
      "+3": [
        "Сила +4",
        "Точность ближних атак +5",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +9",
        "Вес +1750"
      ],
      "+4": [
        "Сила +5",
        "Точность ближних атак +6",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +10",
        "Вес +2000"
      ],
      "+5": [
        "Сила +5",
        "Точность ближних атак +7",
        "Шанс нанести крит. удар +9",
        "Доп. урон при крит. ударе +12",
        "Вес +2250"
      ]
    }
  },
  {
    "name": "Ремень ловкости",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, повышающий ловкость.",
        "Ловкость +1"
      ]
    }
  },
  {
    "name": "Ремень мастера",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Все параметры +1"
      ]
    }
  },
  {
    "name": "Ремень новичка",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Вес +500"
      ]
    }
  },
  {
    "name": "Ремень океана",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Все параметры +2",
        "Вес +1000"
      ]
    }
  },
  {
    "name": "Ремень охотника",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ловкость +3",
        "Точность дальних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "Вес +1000"
      ],
      "+1": [
        "Ловкость +4",
        "Точность дальних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "Вес +1250"
      ],
      "+2": [
        "Ловкость +4",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +7",
        "Вес +1500"
      ],
      "+3": [
        "Ловкость +4",
        "Точность дальних атак +5",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +9",
        "Вес +1750"
      ],
      "+4": [
        "Ловкость +5",
        "Точность дальних атак +6",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +10",
        "Вес +2000"
      ],
      "+5": [
        "Ловкость +5",
        "Точность дальних атак +7",
        "Шанс нанести крит. удар +9",
        "Доп. урон при крит. ударе +12",
        "Вес +2250"
      ]
    }
  },
  {
    "name": "Ремень поглощения",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, увеличивающий поглощение от атак противника.",
        "Поглощение +1"
      ]
    }
  },
  {
    "name": "Ремень праведной ярости",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +1"
      ]
    }
  },
  {
    "name": "Ремень пророка",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уклонение +4",
        "Восстановление HP +0,3",
        "Восстановление MP +0,3",
        "Шанс получить крит. урон -1",
        "Эффект зелий здоровья +1"
      ],
      "+1": [
        "Уклонение +5",
        "Восстановление HP +0,4",
        "Восстановление MP +0,4",
        "Шанс получить крит. урон -2",
        "Эффект зелий здоровья +2"
      ],
      "+2": [
        "Уклонение +6",
        "Восстановление HP +0,5",
        "Восстановление MP +0,5",
        "Шанс получить крит. урон -3",
        "Эффект зелий здоровья +4"
      ],
      "+3": [
        "Уклонение +7",
        "Восстановление HP +0,6",
        "Восстановление MP +0,6",
        "Шанс получить крит. урон -4",
        "Эффект зелий здоровья +5"
      ],
      "+4": [
        "Уклонение +8",
        "Восстановление HP +0,7",
        "Восстановление MP +0,7",
        "Шанс получить крит. урон -5",
        "Эффект зелий здоровья +7"
      ],
      "+5": [
        "Уклонение +9",
        "Восстановление HP +0,8",
        "Восстановление MP +0,8",
        "Шанс получить крит. урон -6",
        "Эффект зелий здоровья +8"
      ]
    }
  },
  {
    "name": "Ремень расправы",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1"
      ]
    }
  },
  {
    "name": "Ремень ратника",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Поглощение +4",
        "HP+50",
        "MP+25",
        "Получаемый крит. урон -2"
      ],
      "+1": [
        "Поглощение +5",
        "HP+100",
        "MP+50",
        "Получаемый крит. урон -4"
      ],
      "+2": [
        "Поглощение +6",
        "HP+200",
        "MP+100",
        "Получаемый крит. урон -6"
      ],
      "+3": [
        "Поглощение +7",
        "HP+250",
        "MP+125",
        "Получаемый крит. урон -8"
      ],
      "+4": [
        "Поглощение +8",
        "HP+350",
        "MP+175",
        "Получаемый крит. урон -10"
      ],
      "+5": [
        "Поглощение +9",
        "HP+400",
        "MP+200",
        "Получаемый крит. урон -12"
      ]
    }
  },
  {
    "name": "Ремень святого поглощения",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, увеличивающий поглощение от атак противника.",
        "Поглощение +4"
      ]
    }
  },
  {
    "name": "Ремень священной ярости",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2"
      ]
    }
  },
  {
    "name": "Ремень силы",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Сила +1"
      ]
    }
  },
  {
    "name": "Ремень солнца",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1",
        "Точность всех атак +1",
        "Вес +1000"
      ]
    }
  },
  {
    "name": "Ремень уклонения",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уклонение +1"
      ]
    }
  },
  {
    "name": "Ремень фанатика",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Поглощение +4",
        "Восстановление HP +0,3",
        "Восстановление MP +0,3",
        "Шанс получить крит. урон -1",
        "Эффект зелий здоровья +1"
      ],
      "+1": [
        "Поглощение +5",
        "Восстановление HP +0,4",
        "Восстановление MP +0,4",
        "Шанс получить крит. урон -2",
        "Эффект зелий здоровья +2"
      ],
      "+2": [
        "Поглощение +6",
        "Восстановление HP +0,5",
        "Восстановление MP +0,5",
        "Шанс получить крит. урон -3",
        "Эффект зелий здоровья +4"
      ],
      "+3": [
        "Поглощение +7",
        "Восстановление HP +0,6",
        "Восстановление MP +0,6",
        "Шанс получить крит. урон -4",
        "Эффект зелий здоровья +5"
      ],
      "+4": [
        "Поглощение +8",
        "Восстановление HP +0,7",
        "Восстановление MP +0,7",
        "Шанс получить крит. урон -5",
        "Эффект зелий здоровья +7"
      ],
      "+5": [
        "Поглощение +9",
        "Восстановление HP +0,8",
        "Восстановление MP +0,8",
        "Шанс получить крит. урон -6",
        "Эффект зелий здоровья +8"
      ]
    }
  },
  {
    "name": "Ремень чародея",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Интеллект +3",
        "Точность магических атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "Вес +1000"
      ],
      "+1": [
        "Интеллект +4",
        "Точность магических атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +4",
        "Вес +1250"
      ],
      "+2": [
        "Интеллект +4",
        "Точность магических атак +4",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +7",
        "Вес +1500"
      ],
      "+3": [
        "Интеллект +4",
        "Точность магических атак +5",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +9",
        "Вес +1750"
      ],
      "+4": [
        "Интеллект +5",
        "Точность магических атак +6",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +10",
        "Вес +2000"
      ],
      "+5": [
        "Интеллект +5",
        "Точность магических атак +7",
        "Шанс нанести крит. удар +9",
        "Доп. урон при крит. ударе +12",
        "Вес +2250"
      ]
    }
  },
  {
    "name": "Ремень чернокнижника",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Интеллект +3",
        "Уровень магических атак +3",
        "Точность магических атак +1",
        "Вес +1000"
      ],
      "+1": [
        "Интеллект +4",
        "Уровень магических атак +3",
        "Точность магических атак +1",
        "Вес +1250"
      ],
      "+2": [
        "Интеллект +5",
        "Уровень магических атак +4",
        "Точность магических атак +1",
        "Вес +1500"
      ],
      "+3": [
        "Интеллект +6",
        "Уровень магических атак +5",
        "Точность магических атак +2",
        "Вес +1750"
      ],
      "+4": [
        "Интеллект +7",
        "Уровень магических атак +6",
        "Точность магических атак +2",
        "Вес +2000"
      ],
      "+5": [
        "Интеллект +8",
        "Уровень магических атак +7",
        "Точность магических атак +3",
        "Вес +2250"
      ]
    }
  },
  {
    "name": "Ремень ярости",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1"
      ]
    }
  },
  {
    "name": "Светящийся ремень интеллекта",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, увеличивающий интеллект.",
        "Интеллект +2"
      ]
    }
  },
  {
    "name": "Светящийся ремень ловкости",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Ремень, повышающий ловкость.",
        "Ловкость +2"
      ]
    }
  },
  {
    "name": "Светящийся ремень силы",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Сила +2"
      ]
    }
  },
  {
    "name": "Стеклянный ремень",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уклонение +2"
      ]
    }
  },
  {
    "name": "Улучшенный ремень воздуха",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +3",
        "Вес +1250"
      ]
    }
  },
  {
    "name": "Улучшенный ремень восстановления",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,2",
        "Восстановление MP +0,2",
        "Вес +800"
      ]
    }
  },
  {
    "name": "Улучшенный ремень выживания",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "HP +40",
        "MP +20",
        "Вес +800"
      ]
    }
  },
  {
    "name": "Улучшенный ремень земли",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +3",
        "Вес +1250"
      ]
    }
  },
  {
    "name": "Улучшенный ремень океана",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1",
        "Все параметры +2",
        "Вес +1250"
      ]
    }
  },
  {
    "name": "Улучшенный ремень солнца",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Точность всех атак +2",
        "Вес +1250"
      ]
    }
  },
  {
    "name": "Усиленный ремень воздуха",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +5",
        "Вес +1500"
      ]
    }
  },
  {
    "name": "Усиленный ремень восстановления",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,3",
        "Восстановление MP +0,3",
        "Вес +1200"
      ]
    }
  },
  {
    "name": "Усиленный ремень выживания",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "HP +50",
        "MP +25",
        "Вес +1200"
      ]
    }
  },
  {
    "name": "Усиленный ремень земли",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +5",
        "Вес +1500"
      ]
    }
  },
  {
    "name": "Усиленный ремень океана",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Точность всех атак +1",
        "Все параметры +2",
        "Вес +1500"
      ]
    }
  },
  {
    "name": "Усиленный ремень солнца",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +3",
        "Вес +1500"
      ]
    }
  },
  {
    "name": "Усовершенствованный ремень воздуха",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +7",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -2",
        "Вес +1750"
      ]
    }
  },
  {
    "name": "Усовершенствованный ремень земли",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +7",
        "Эффективность уровня зелий +1",
        "HP +25"
      ]
    }
  },
  {
    "name": "Усовершенствованный ремень океана",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +2",
        "Все параметры +2",
        "Вес +1750"
      ]
    }
  },
  {
    "name": "Усовершенствованный ремень солнца",
    "slot_code": "belt",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +4",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1",
        "Вес +1750"
      ]
    }
  },
  {
    "name": "Магические мифриловые перчатки",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "HP +20"
      ],
      "+1": [
        "Защита +7",
        "HP +25"
      ],
      "+2": [
        "Защита +8",
        "HP +30"
      ],
      "+3": [
        "Защита +9",
        "HP +35"
      ],
      "+4": [
        "Защита +10",
        "HP +40"
      ],
      "+5": [
        "Защита +11",
        "HP +45",
        "Шанс получить крит. удар -1"
      ],
      "+6": [
        "Защита +12",
        "HP +50",
        "Шанс получить крит. удар -1"
      ],
      "+7": [
        "Защита +14",
        "HP +55",
        "Шанс получить крит. удар -2"
      ],
      "+8": [
        "Защита +16",
        "HP +60",
        "Шанс получить крит. удар -2"
      ],
      "+9": [
        "Защита +18",
        "HP +65",
        "Шанс получить крит. удар -3"
      ],
      "+10": [
        "Защита +20",
        "HP +70",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +22",
        "HP +75",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +24",
        "HP +80",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +26",
        "HP +85",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Магические мифриловые перчатки (прок.)",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "HP +20"
      ],
      "+1": [
        "Защита +7",
        "HP +25"
      ],
      "+2": [
        "Защита +8",
        "HP +30"
      ],
      "+3": [
        "Защита +9",
        "HP +35"
      ],
      "+4": [
        "Защита +10",
        "HP +40"
      ],
      "+5": [
        "Защита +11",
        "HP +45",
        "Шанс получить крит. удар -1"
      ],
      "+6": [
        "Защита +12",
        "HP +50",
        "Шанс получить крит. удар -1"
      ],
      "+7": [
        "Защита +14",
        "HP +55",
        "Шанс получить крит. удар -2"
      ],
      "+8": [
        "Защита +16",
        "HP +60",
        "Шанс получить крит. удар -2"
      ],
      "+9": [
        "Защита +18",
        "HP +65",
        "Шанс получить крит. удар -3"
      ],
      "+10": [
        "Защита +20",
        "HP +70",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +22",
        "HP +75",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +24",
        "HP +80",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +26",
        "HP +85",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Магические перчатки Велкена",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "HP +15"
      ],
      "+1": [
        "Защита +7",
        "HP +20"
      ],
      "+2": [
        "Защита +8",
        "HP +25"
      ],
      "+3": [
        "Защита +9",
        "HP +30"
      ],
      "+4": [
        "Защита +10",
        "HP +35"
      ],
      "+5": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "HP +40"
      ],
      "+6": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "HP +45"
      ],
      "+7": [
        "Защита +14",
        "Шанс получить крит. удар -2",
        "HP +50"
      ],
      "+8": [
        "Защита +16",
        "Шанс получить крит. удар -2",
        "HP +55"
      ],
      "+9": [
        "Защита +18",
        "Шанс получить крит. удар -3",
        "HP +60"
      ],
      "+10": [
        "Защита +20",
        "Шанс получить крит. удар -3",
        "HP +65"
      ],
      "+11": [
        "Защита +22",
        "Шанс получить крит. удар -4",
        "HP +70"
      ],
      "+12": [
        "Защита +24",
        "Шанс получить крит. удар -5",
        "HP +75"
      ],
      "+13": [
        "Защита +26",
        "Шанс получить крит. удар -6",
        "HP +80"
      ]
    }
  },
  {
    "name": "Магические перчатки Велкена (прок.)",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "HP +15"
      ],
      "+1": [
        "Защита +7",
        "HP +20"
      ],
      "+2": [
        "Защита +8",
        "HP +25"
      ],
      "+3": [
        "Защита +9",
        "HP +30"
      ],
      "+4": [
        "Защита +10",
        "HP +35"
      ],
      "+5": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "HP +40"
      ],
      "+6": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "HP +45"
      ],
      "+7": [
        "Защита +14",
        "Шанс получить крит. удар -2",
        "HP +50"
      ],
      "+8": [
        "Защита +16",
        "Шанс получить крит. удар -2",
        "HP +55"
      ],
      "+9": [
        "Защита +18",
        "Шанс получить крит. удар -3",
        "HP +60"
      ],
      "+10": [
        "Защита +20",
        "Шанс получить крит. удар -3",
        "HP +65"
      ],
      "+11": [
        "Защита +22",
        "Шанс получить крит. удар -4",
        "HP +70"
      ],
      "+12": [
        "Защита +24",
        "Шанс получить крит. удар -5",
        "HP +75"
      ],
      "+13": [
        "Защита +26",
        "Шанс получить крит. удар -6",
        "HP +80"
      ]
    }
  },
  {
    "name": "Мифриловые перчатки",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +5"
      ],
      "+1": [
        "Защита +6"
      ],
      "+2": [
        "Защита +7"
      ],
      "+3": [
        "Защита +8"
      ],
      "+4": [
        "Защита +9"
      ],
      "+5": [
        "Защита +10"
      ],
      "+6": [
        "Защита +11"
      ],
      "+7": [
        "Защита +13",
        "Шанс получить крит. удар -1"
      ],
      "+8": [
        "Защита +15",
        "Шанс получить крит. удар -1"
      ],
      "+9": [
        "Защита +17",
        "Шанс получить крит. удар -2"
      ],
      "+10": [
        "Защита +19",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +21",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +23",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +25",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Перчатки Бафомета",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +6"
      ],
      "+1": [
        "Защита +7"
      ],
      "+2": [
        "Защита +8",
        "Скорость атаки +1%"
      ],
      "+3": [
        "Защита +9",
        "Скорость атаки +3%"
      ],
      "+4": [
        "Защита +10",
        "Шанс получить крит. удар -1",
        "Скорость атаки +5%"
      ],
      "+5": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Скорость атаки +7%"
      ],
      "+6": [
        "Защита +12",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Скорость атаки +9%"
      ],
      "+7": [
        "Защита +14",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Скорость атаки +11%"
      ],
      "+8": [
        "Защита +16",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -2",
        "Скорость атаки +12%"
      ],
      "+9": [
        "Защита +18",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Скорость атаки +13%"
      ],
      "+10": [
        "Защита +20",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -4",
        "Скорость атаки +14%"
      ],
      "+11": [
        "Защита +22",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Скорость атаки +15%"
      ],
      "+12": [
        "Защита +24",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Скорость атаки +16%"
      ],
      "+13": [
        "Защита +26",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Скорость атаки +17%"
      ]
    }
  },
  {
    "name": "Перчатки Велкена",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +5",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника."
      ],
      "+1": [
        "Защита +6",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника."
      ],
      "+2": [
        "Защита +7",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника."
      ],
      "+3": [
        "Защита +8",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника."
      ],
      "+4": [
        "Защита +9",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника."
      ],
      "+5": [
        "Защита +10",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника."
      ],
      "+6": [
        "Защита +11",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника."
      ],
      "+7": [
        "Защита +13",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника.",
        "Шанс получить крит. удар -1"
      ],
      "+8": [
        "Защита +15",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника.",
        "Шанс получить крит. удар -1"
      ],
      "+9": [
        "Защита +17",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника.",
        "Шанс получить крит. удар -2"
      ],
      "+10": [
        "Защита +19",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника.",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +21",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника.",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +23",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника.",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +25",
        "Благодаря малому весу, позволяют с легкостью уйти от атак противника.",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Перчатки Ифрита",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +7"
      ],
      "+1": [
        "Защита +8"
      ],
      "+2": [
        "Защита +9"
      ],
      "+3": [
        "Защита +10",
        "Шанс получить крит. удар -1"
      ],
      "+4": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Все параметры +1"
      ],
      "+5": [
        "Защита +12",
        "Шанс получить крит. удар -2",
        "Получение критического урона -1",
        "Все параметры +1"
      ],
      "+6": [
        "Защита +13",
        "Шанс получить крит. удар -2",
        "Получение критического урона -1",
        "Все параметры +2"
      ],
      "+7": [
        "Защита +15",
        "Шанс получить крит. удар -3",
        "Получение критического урона -2",
        "Все параметры +2"
      ],
      "+8": [
        "Защита +17",
        "Шанс получить крит. удар -3",
        "Получение критического урона -3",
        "Все параметры +2"
      ],
      "+9": [
        "Защита +19",
        "Шанс получить крит. удар -4",
        "Получение критического урона -4",
        "Все параметры +3"
      ],
      "+10": [
        "Защита +21",
        "Шанс получить крит. удар -4",
        "Получение критического урона -5",
        "Все параметры +3"
      ],
      "+11": [
        "Защита +23",
        "Шанс получить крит. удар -5",
        "Получение критического урона -6",
        "Все параметры +4"
      ],
      "+12": [
        "Защита +25",
        "Шанс получить крит. удар -6",
        "Получение критического урона -7",
        "Все параметры +4"
      ],
      "+13": [
        "Защита +27",
        "Шанс получить крит. удар -7",
        "Получение критического урона -8",
        "Все параметры +5"
      ]
    }
  },
  {
    "name": "Перчатки новичка",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +4"
      ]
    }
  },
  {
    "name": "Перчатки тьмы",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +4"
      ],
      "+1": [
        "Защита +5"
      ],
      "+2": [
        "Защита +6"
      ],
      "+3": [
        "Защита +7"
      ],
      "+4": [
        "Защита +8"
      ],
      "+5": [
        "Защита +9"
      ],
      "+6": [
        "Защита +10"
      ],
      "+7": [
        "Защита +12"
      ],
      "+8": [
        "Защита +14"
      ],
      "+9": [
        "Защита +16"
      ]
    }
  },
  {
    "name": "Перчатки энергии Ифрита",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +7"
      ],
      "+1": [
        "Защита +8"
      ],
      "+2": [
        "Защита +9",
        "Скорость атаки +1%"
      ],
      "+3": [
        "Защита +10",
        "Шанс получить крит. удар -1",
        "Скорость атаки +1%"
      ],
      "+4": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Скорость атаки +1%"
      ],
      "+5": [
        "Защита +12",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Скорость атаки +2%"
      ],
      "+6": [
        "Защита +13",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Скорость атаки +2%"
      ],
      "+7": [
        "Защита +15",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -2",
        "Скорость атаки +2%"
      ],
      "+8": [
        "Защита +17",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Скорость атаки +3%"
      ],
      "+9": [
        "Защита +19",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -4",
        "Скорость атаки +3%"
      ],
      "+10": [
        "Защита +21",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Скорость атаки +4%"
      ],
      "+11": [
        "Защита +23",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Скорость атаки +4%"
      ],
      "+12": [
        "Защита +25",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Скорость атаки +5%"
      ],
      "+13": [
        "Защита +27",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -8",
        "Скорость атаки +5%"
      ]
    }
  },
  {
    "name": "Перчатки ярости Бафомета",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +6"
      ],
      "+1": [
        "Защита +7"
      ],
      "+2": [
        "Защита +8"
      ],
      "+3": [
        "Защита +9",
        "Шанс нанести крит. удар +1"
      ],
      "+4": [
        "Защита +10",
        "Шанс нанести крит. удар +2"
      ],
      "+5": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Шанс нанести крит. удар +3"
      ],
      "+6": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Шанс нанести крит. удар +4"
      ],
      "+7": [
        "Защита +14",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Шанс нанести крит. удар +5"
      ],
      "+8": [
        "Защита +16",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2",
        "Шанс нанести крит. удар +5"
      ],
      "+9": [
        "Защита +18",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Шанс нанести крит. удар +6"
      ],
      "+10": [
        "Защита +20",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4",
        "Шанс нанести крит. удар +6"
      ],
      "+11": [
        "Защита +22",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Шанс нанести крит. удар +7"
      ],
      "+12": [
        "Защита +24",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Шанс нанести крит. удар +8"
      ],
      "+13": [
        "Защита +26",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Шанс нанести крит. удар +9"
      ]
    }
  },
  {
    "name": "Стальные перчатки",
    "slot_code": "gloves",
    "upgrade_levels": {
      "+0": [
        "Защита +4"
      ]
    }
  },
  {
    "name": "Блестящее кольцо интеллекта",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее интеллект.",
        "Интеллект +3",
        "Уровень магических атак +1",
        "Точность магических атак +1"
      ]
    }
  },
  {
    "name": "Блестящее кольцо ловкости",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее ловкость.",
        "Ловкость +3",
        "Уровень дальних атак +1",
        "Точность дальних атак +1"
      ]
    }
  },
  {
    "name": "Блестящее кольцо силы",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Сила +3",
        "Уровень ближних атак +1",
        "Точность ближних атак +1"
      ]
    }
  },
  {
    "name": "Кольцо атаки",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +5"
      ]
    }
  },
  {
    "name": "Кольцо берсерка",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Сила +4",
        "Уровень ближних атак +3",
        "Точность ближних атак +1",
        "Скорость атаки +10%"
      ],
      "+1": [
        "Сила +5",
        "Уровень ближних атак +3",
        "Точность ближних атак +1",
        "Скорость атаки +11%"
      ],
      "+2": [
        "Сила +5",
        "Уровень ближних атак +4",
        "Точность ближних атак +1",
        "Скорость атаки +13%"
      ],
      "+3": [
        "Сила +6",
        "Уровень ближних атак +4",
        "Точность ближних атак +2",
        "Скорость атаки +15%"
      ],
      "+4": [
        "Сила +6",
        "Уровень ближних атак +5",
        "Точность ближних атак +2",
        "Скорость атаки +17%"
      ],
      "+5": [
        "Сила +7",
        "Уровень ближних атак +5",
        "Точность ближних атак +3",
        "Скорость атаки +19%"
      ]
    }
  },
  {
    "name": "Кольцо божественного поглощения",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее поглощение от атак противника.",
        "Поглощение +3"
      ]
    }
  },
  {
    "name": "Кольцо воздуха",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +2",
        "Восстановление HP +0,2"
      ]
    }
  },
  {
    "name": "Кольцо восстановления",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,2",
        "Восстановление MP +0,2",
        "Вес +500"
      ]
    }
  },
  {
    "name": "Кольцо выживания",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "HP +60",
        "MP +30",
        "Вес +500"
      ]
    }
  },
  {
    "name": "Кольцо высокого интеллекта",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее интеллект.",
        "Интеллект +4",
        "Уровень магических атак +2",
        "Точность магических атак +1"
      ]
    }
  },
  {
    "name": "Кольцо высокой ловкости",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее ловкость.",
        "Ловкость +4",
        "Уровень дальних атак +2",
        "Точность дальних атак +1"
      ]
    }
  },
  {
    "name": "Кольцо высокой силы",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Сила +4",
        "Уровень ближних атак +2",
        "Точность ближних атак +1"
      ]
    }
  },
  {
    "name": "Кольцо гладиатора",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уклонение +5",
        "HP+100",
        "MP+50",
        "Получаемый крит. урон -4"
      ],
      "+1": [
        "Уклонение +6",
        "HP+150",
        "MP+75",
        "Получаемый крит. урон -6"
      ],
      "+2": [
        "Уклонение +7",
        "HP+250",
        "MP+125",
        "Получаемый крит. урон -8"
      ],
      "+3": [
        "Уклонение +8",
        "HP+300",
        "MP+150",
        "Получаемый крит. урон -10"
      ],
      "+4": [
        "Уклонение +9",
        "HP+400",
        "MP+200",
        "Получаемый крит. урон -12"
      ],
      "+5": [
        "Уклонение +10",
        "HP+450",
        "MP+225",
        "Получаемый крит. урон -14"
      ]
    }
  },
  {
    "name": "Кольцо гнева",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее уровень концентрации.",
        "Уровень всех атак +3",
        "Точность всех атак +1",
        "Скорость атаки +10%"
      ]
    }
  },
  {
    "name": "Кольцо головореза",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Ловкость +4",
        "Уровень дальних атак +3",
        "Точность дальних атак +1",
        "Скорость атаки +10%"
      ],
      "+1": [
        "Ловкость +5",
        "Уровень дальних атак +3",
        "Точность дальних атак +1",
        "Скорость атаки +11%"
      ],
      "+2": [
        "Ловкость +5",
        "Уровень дальних атак +4",
        "Точность дальних атак +1",
        "Скорость атаки +13%"
      ],
      "+3": [
        "Ловкость +6",
        "Уровень дальних атак +4",
        "Точность дальних атак +2",
        "Скорость атаки +15%"
      ],
      "+4": [
        "Ловкость +6",
        "Уровень дальних атак +5",
        "Точность дальних атак +2",
        "Скорость атаки +17%"
      ],
      "+5": [
        "Ловкость +7",
        "Уровень дальних атак +5",
        "Точность дальних атак +3",
        "Скорость атаки +19%"
      ]
    }
  },
  {
    "name": "Кольцо гривеносного дракона",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Награда за 5-е место в гонках.",
        "Скорость бега +20"
      ]
    }
  },
  {
    "name": "Кольцо грифона",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Скорость бега +5"
      ]
    }
  },
  {
    "name": "Кольцо грозового дракона",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Награда за 2-е место в гонках.",
        "Скорость бега +50"
      ]
    }
  },
  {
    "name": "Кольцо доблести",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее уровень концентрации.",
        "Уровень всех атак +1"
      ]
    }
  },
  {
    "name": "Кольцо земли",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +2",
        "Эффективность уровня зелий +1"
      ]
    }
  },
  {
    "name": "Кольцо златорогого дракона",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Награда за 4-е место в гонках.",
        "Скорость бега +30"
      ]
    }
  },
  {
    "name": "Кольцо интеллекта",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее интеллект.",
        "Интеллект +1"
      ]
    }
  },
  {
    "name": "Кольцо карателя",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Сила +4",
        "Уровень ближних атак +2",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +5"
      ],
      "+1": [
        "Сила +5",
        "Уровень ближних атак +2",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +6"
      ],
      "+2": [
        "Сила +5",
        "Уровень ближних атак +3",
        "Точность ближних атак +3",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +6"
      ],
      "+3": [
        "Сила +6",
        "Уровень ближних атак +3",
        "Точность ближних атак +4",
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +7"
      ],
      "+4": [
        "Сила +6",
        "Уровень ближних атак +4",
        "Точность ближних атак +4",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +7"
      ],
      "+5": [
        "Сила +7",
        "Уровень ближних атак +4",
        "Точность ближних атак +5",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +8"
      ]
    }
  },
  {
    "name": "Кольцо ловкости",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее ловкость.",
        "Ловкость +1"
      ]
    }
  },
  {
    "name": "Кольцо огненного дракона",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Награда за 1-е место в гонках.",
        "Скорость бега +60"
      ]
    }
  },
  {
    "name": "Кольцо океана",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1",
        "Все параметры +1"
      ]
    }
  },
  {
    "name": "Кольцо охотника",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Ловкость +4",
        "Уровень дальних атак +2",
        "Точность дальних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +5"
      ],
      "+1": [
        "Ловкость +5",
        "Уровень дальних атак +2",
        "Точность дальних атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +6"
      ],
      "+2": [
        "Ловкость +5",
        "Уровень дальних атак +3",
        "Точность дальних атак +3",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +6"
      ],
      "+3": [
        "Ловкость +6",
        "Уровень дальних атак +3",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +7"
      ],
      "+4": [
        "Ловкость +6",
        "Уровень дальних атак +4",
        "Точность дальних атак +4",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +7"
      ],
      "+5": [
        "Ловкость +7",
        "Уровень дальних атак +4",
        "Точность дальних атак +5",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +8"
      ]
    }
  },
  {
    "name": "Кольцо перевоплощения",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Все параметры +2"
      ]
    }
  },
  {
    "name": "Кольцо перевоплощения (легендарное)",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Защита +12",
        "Все параметры +5",
        "Скорость атаки +3%",
        "Уровень всех атак +2",
        "Шанс выпадения трофеев +6%"
      ]
    }
  },
  {
    "name": "Кольцо перевоплощения (редкое)",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Защита +4",
        "Все параметры +3",
        "Шанс выпадения трофеев +2%"
      ]
    }
  },
  {
    "name": "Кольцо перевоплощения (эпич.) (врем.)",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Защита +8",
        "Все параметры +4",
        "Уровень всех атак +1",
        "Шанс выпадения трофеев +4%"
      ]
    }
  },
  {
    "name": "Кольцо перевоплощения (эпическое)",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Защита +8",
        "Все параметры +4",
        "Уровень всех атак +1",
        "Шанс выпадения трофеев +4%"
      ]
    }
  },
  {
    "name": "Кольцо поглощения",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Поглощение 1"
      ]
    }
  },
  {
    "name": "Кольцо преграды",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +2",
        "Шанс нанести крит. удар +2",
        "Доп. урон при крит. ударе +2"
      ]
    }
  },
  {
    "name": "Кольцо пророка",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уклонение +5",
        "Восстановление HP +0,4",
        "Восстановление MP +0,4",
        "Шанс получить крит. урон -2",
        "Эффект зелий здоровья +2"
      ],
      "+1": [
        "Уклонение +6",
        "Восстановление HP +0,5",
        "Восстановление MP +0,5",
        "Шанс получить крит. урон -3",
        "Эффект зелий здоровья +3"
      ],
      "+2": [
        "Уклонение +7",
        "Восстановление HP +0,6",
        "Восстановление MP +0,6",
        "Шанс получить крит. урон -4",
        "Эффект зелий здоровья +5"
      ],
      "+3": [
        "Уклонение +8",
        "Восстановление HP +0,7",
        "Восстановление MP +0,7",
        "Шанс получить крит. урон -5",
        "Эффект зелий здоровья +6"
      ],
      "+4": [
        "Уклонение +9",
        "Восстановление HP +0,8",
        "Восстановление MP +0,8",
        "Шанс получить крит. урон -6",
        "Эффект зелий здоровья +8"
      ],
      "+5": [
        "Уклонение +10",
        "Восстановление HP +0,9",
        "Восстановление MP +0,9",
        "Шанс получить крит. урон -7",
        "Эффект зелий здоровья +9"
      ]
    }
  },
  {
    "name": "Кольцо разрушения",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее уровень концентрации.",
        "Уровень всех атак +2",
        "Точность всех атак +1",
        "Скорость атаки +5%"
      ]
    }
  },
  {
    "name": "Кольцо ратника",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Поглощение +5",
        "HP+100",
        "MP+50",
        "Получаемый крит. урон -4"
      ],
      "+1": [
        "Поглощение +6",
        "HP+150",
        "MP+75",
        "Получаемый крит. урон -6"
      ],
      "+2": [
        "Поглощение +7",
        "HP+250",
        "MP+125",
        "Получаемый крит. урон -8"
      ],
      "+3": [
        "Поглощение +8",
        "HP+300",
        "MP+150",
        "Получаемый крит. урон -10"
      ],
      "+4": [
        "Поглощение +9",
        "HP+400",
        "MP+200",
        "Получаемый крит. урон -12"
      ],
      "+5": [
        "Поглощение +10",
        "HP+450",
        "MP+225",
        "Получаемый крит. урон -14"
      ]
    }
  },
  {
    "name": "Кольцо святого поглощения",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Поглощение +5"
      ]
    }
  },
  {
    "name": "Кольцо силы",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Сила +1"
      ]
    }
  },
  {
    "name": "Кольцо славы",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": []
    }
  },
  {
    "name": "Кольцо смелости",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее уровень концентрации.",
        "Уровень всех атак +1",
        "Точность всех атак +1",
        "Скорость атаки +3%"
      ]
    }
  },
  {
    "name": "Кольцо смертельной атаки",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +2",
        "Доп. урон при крит. ударе +3"
      ]
    }
  },
  {
    "name": "Кольцо солнца",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +1"
      ]
    }
  },
  {
    "name": "Кольцо тайфуна",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1"
      ]
    }
  },
  {
    "name": "Кольцо телепортации",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Управление перемещением"
      ]
    }
  },
  {
    "name": "Кольцо телепортации (легендарное)",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Управление телепортацией"
      ]
    }
  },
  {
    "name": "Кольцо телепортации (редкое)",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Управление телепортацией"
      ]
    }
  },
  {
    "name": "Кольцо телепортации (эпическое)",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Управление телепортацией"
      ]
    }
  },
  {
    "name": "Кольцо уклонения",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уклонение +1"
      ]
    }
  },
  {
    "name": "Кольцо фанатика",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Поглощение +5",
        "Восстановление HP +0,4",
        "Восстановление MP +0,4",
        "Шанс получить крит. урон -2",
        "Эффект зелий здоровья +2"
      ],
      "+1": [
        "Поглощение +6",
        "Восстановление HP +0,5",
        "Восстановление MP +0,5",
        "Шанс получить крит. урон -3",
        "Эффект зелий здоровья +3"
      ],
      "+2": [
        "Поглощение +7",
        "Восстановление HP +0,6",
        "Восстановление MP +0,6",
        "Шанс получить крит. урон -4",
        "Эффект зелий здоровья +5"
      ],
      "+3": [
        "Поглощение +8",
        "Восстановление HP +0,7",
        "Восстановление MP +0,7",
        "Шанс получить крит. урон -5",
        "Эффект зелий здоровья +6"
      ],
      "+4": [
        "Поглощение +9",
        "Восстановление HP +0,8",
        "Восстановление MP +0,8",
        "Шанс получить крит. урон -6",
        "Эффект зелий здоровья +8"
      ],
      "+5": [
        "Поглощение +10",
        "Восстановление HP +0,9",
        "Восстановление MP +0,9",
        "Шанс получить крит. урон -7",
        "Эффект зелий здоровья +9"
      ]
    }
  },
  {
    "name": "Кольцо химеры",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Скорость бега +5"
      ]
    }
  },
  {
    "name": "Кольцо холода",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уклонение +5"
      ]
    }
  },
  {
    "name": "Кольцо чародея",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Интеллект +4",
        "Уровень магических атак +2",
        "Точность магических атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +5"
      ],
      "+1": [
        "Интеллект +5",
        "Уровень магических атак +2",
        "Точность магических атак +3",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +6"
      ],
      "+2": [
        "Интеллект +5",
        "Уровень магических атак +3",
        "Точность магических атак +3",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +6"
      ],
      "+3": [
        "Интеллект +6",
        "Уровень магических атак +3",
        "Точность магических атак +4",
        "Шанс нанести крит. удар +5",
        "Доп. урон при крит. ударе +7"
      ],
      "+4": [
        "Интеллект +6",
        "Уровень магических атак +4",
        "Точность магических атак +4",
        "Шанс нанести крит. удар +6",
        "Доп. урон при крит. ударе +7"
      ],
      "+5": [
        "Интеллект +7",
        "Уровень магических атак +4",
        "Точность магических атак +5",
        "Шанс нанести крит. удар +7",
        "Доп. урон при крит. ударе +8"
      ]
    }
  },
  {
    "name": "Кольцо чернокнижника",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Интеллект +4",
        "Уровень магических атак +3",
        "Точность магических атак +1",
        "Скорость атаки +10%"
      ],
      "+1": [
        "Интеллект +5",
        "Уровень магических атак +3",
        "Точность магических атак +1",
        "Скорость атаки +11%"
      ],
      "+2": [
        "Интеллект +5",
        "Уровень магических атак +4",
        "Точность магических атак +1",
        "Скорость атаки +13%"
      ],
      "+3": [
        "Интеллект +6",
        "Уровень магических атак +4",
        "Точность магических атак +2",
        "Скорость атаки +15%"
      ],
      "+4": [
        "Интеллект +6",
        "Уровень магических атак +5",
        "Точность магических атак +2",
        "Скорость атаки +17%"
      ],
      "+5": [
        "Интеллект +7",
        "Уровень магических атак +5",
        "Точность магических атак +3",
        "Скорость атаки +19%"
      ]
    }
  },
  {
    "name": "Кольцо шипастого дракона",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Награда за 3-е место в гонках.",
        "Скорость бега +40"
      ]
    }
  },
  {
    "name": "Светящееся кольцо интеллекта",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее интеллект.",
        "Интеллект +2",
        "Точность магических атак +1"
      ]
    }
  },
  {
    "name": "Светящееся кольцо ловкости",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Кольцо, увеличивающее ловкость.",
        "Ловкость +2",
        "Точность дальних атак +1"
      ]
    }
  },
  {
    "name": "Светящееся кольцо силы",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Сила +2",
        "Точность ближних атак +1"
      ]
    }
  },
  {
    "name": "Стеклянное кольцо",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уклонение +3"
      ]
    }
  },
  {
    "name": "Улучшенное кольцо воздуха",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +4",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -2",
        "Восстановление HP +0,4"
      ]
    }
  },
  {
    "name": "Улучшенное кольцо восстановления",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,3",
        "Восстановление MP +0,3",
        "Вес +1000"
      ]
    }
  },
  {
    "name": "Улучшенное кольцо выживания",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "HP +80",
        "MP +40",
        "Вес +1000"
      ]
    }
  },
  {
    "name": "Улучшенное кольцо земли",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +4",
        "Эффективность уровня зелий +2"
      ]
    }
  },
  {
    "name": "Улучшенное кольцо океана",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Все параметры +2",
        "Скорость атаки +3%"
      ]
    }
  },
  {
    "name": "Улучшенное кольцо солнца",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +2",
        "Точность всех атак +1",
        "Шанс нанести крит. удар +1",
        "Доп. урон при крит. ударе +1",
        "Скорость атаки +3%"
      ]
    }
  },
  {
    "name": "Усиленное кольцо воздуха",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +6",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -4",
        "Восстановление HP +0,6"
      ]
    }
  },
  {
    "name": "Усиленное кольцо восстановления",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Восстановление HP +0,4",
        "Восстановление MP +0,4",
        "Вес +1500"
      ]
    }
  },
  {
    "name": "Усиленное кольцо выживания",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "HP +100",
        "MP +50",
        "Вес +1500"
      ]
    }
  },
  {
    "name": "Усиленное кольцо земли",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +6",
        "Эффективность уровня зелий +3",
        "HP +50"
      ]
    }
  },
  {
    "name": "Усиленное кольцо океана",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +1",
        "Все параметры +3",
        "Скорость атаки +6%"
      ]
    }
  },
  {
    "name": "Усиленное кольцо солнца",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +3",
        "Точность всех атак +2",
        "Шанс нанести крит. удар +3",
        "Доп. урон при крит. ударе +3",
        "Скорость атаки +6%"
      ]
    }
  },
  {
    "name": "Усовершенствованное кольцо воздуха",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает уклонение за счет силы воздуха.",
        "Уклонение +8",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -6",
        "Восстановление HP +1"
      ]
    }
  },
  {
    "name": "Усовершенствованное кольцо земли",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Увеличивает поглощение силой земли.",
        "Поглощение +8",
        "Эффективность уровня зелий +5",
        "HP +100"
      ]
    }
  },
  {
    "name": "Усовершенствованное кольцо океана",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +4",
        "Точность всех атак +2",
        "Все параметры +4",
        "Скорость атаки +9%"
      ]
    }
  },
  {
    "name": "Усовершенствованное кольцо солнца",
    "slot_code": "ring",
    "upgrade_levels": {
      "+0": [
        "Уровень всех атак +4",
        "Точность всех атак +3",
        "Шанс нанести крит. удар +4",
        "Доп. урон при крит. ударе +4",
        "Скорость атаки +9%"
      ]
    }
  },
  {
    "name": "Магические мифриловые сапоги",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "HP +20"
      ],
      "+1": [
        "Защита +7",
        "HP +25"
      ],
      "+2": [
        "Защита +8",
        "HP +30"
      ],
      "+3": [
        "Защита +9",
        "HP +35"
      ],
      "+4": [
        "Защита +10",
        "HP +40"
      ],
      "+5": [
        "Защита +11",
        "HP +45",
        "Шанс получить крит. удар -1"
      ],
      "+6": [
        "Защита +12",
        "HP +50",
        "Шанс получить крит. удар -1"
      ],
      "+7": [
        "Защита +14",
        "HP +55",
        "Шанс получить крит. удар -2"
      ],
      "+8": [
        "Защита +16",
        "HP +60",
        "Шанс получить крит. удар -2"
      ],
      "+9": [
        "Защита +18",
        "HP +65",
        "Шанс получить крит. удар -3"
      ],
      "+10": [
        "Защита +20",
        "HP +70",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +22",
        "HP +75",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +24",
        "HP +80",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +26",
        "HP +85",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Магические мифриловые сапоги (прок.)",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "HP +20"
      ],
      "+1": [
        "Защита +7",
        "HP +25"
      ],
      "+2": [
        "Защита +8",
        "HP +30"
      ],
      "+3": [
        "Защита +9",
        "HP +35"
      ],
      "+4": [
        "Защита +10",
        "HP +40"
      ],
      "+5": [
        "Защита +11",
        "HP +45",
        "Шанс получить крит. удар -1"
      ],
      "+6": [
        "Защита +12",
        "HP +50",
        "Шанс получить крит. удар -1"
      ],
      "+7": [
        "Защита +14",
        "HP +55",
        "Шанс получить крит. удар -2"
      ],
      "+8": [
        "Защита +16",
        "HP +60",
        "Шанс получить крит. удар -2"
      ],
      "+9": [
        "Защита +18",
        "HP +65",
        "Шанс получить крит. удар -3"
      ],
      "+10": [
        "Защита +20",
        "HP +70",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +22",
        "HP +75",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +24",
        "HP +80",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +26",
        "HP +85",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Магические сапоги Велкена",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "HP +15"
      ],
      "+1": [
        "Защита +7",
        "HP +20"
      ],
      "+2": [
        "Защита +8",
        "HP +25"
      ],
      "+3": [
        "Защита +9",
        "HP +30"
      ],
      "+4": [
        "Защита +10",
        "HP +35"
      ],
      "+5": [
        "Защита +11",
        "HP +40",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +12",
        "HP +45",
        "Получаемый крит. урон -1"
      ],
      "+7": [
        "Защита +14",
        "HP +50",
        "Получаемый крит. урон -2"
      ],
      "+8": [
        "Защита +16",
        "HP +55",
        "Получаемый крит. урон -2"
      ],
      "+9": [
        "Защита +18",
        "HP +60",
        "Получаемый крит. урон -3"
      ],
      "+10": [
        "Защита +20",
        "HP +65",
        "Получаемый крит. урон -3"
      ],
      "+11": [
        "Защита +22",
        "HP +70",
        "Получаемый крит. урон -4"
      ],
      "+12": [
        "Защита +24",
        "HP +75",
        "Получаемый крит. урон -5"
      ],
      "+13": [
        "Защита +26",
        "HP +80",
        "Получаемый крит. урон -6"
      ]
    }
  },
  {
    "name": "Магические сапоги Велкена (прок.)",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +6",
        "HP +15"
      ],
      "+1": [
        "Защита +7",
        "HP +20"
      ],
      "+2": [
        "Защита +8",
        "HP +25"
      ],
      "+3": [
        "Защита +9",
        "HP +30"
      ],
      "+4": [
        "Защита +10",
        "HP +35"
      ],
      "+5": [
        "Защита +11",
        "HP +40",
        "Получаемый крит. урон -1"
      ],
      "+6": [
        "Защита +12",
        "HP +45",
        "Получаемый крит. урон -1"
      ],
      "+7": [
        "Защита +14",
        "HP +50",
        "Получаемый крит. урон -2"
      ],
      "+8": [
        "Защита +16",
        "HP +55",
        "Получаемый крит. урон -2"
      ],
      "+9": [
        "Защита +18",
        "HP +60",
        "Получаемый крит. урон -3"
      ],
      "+10": [
        "Защита +20",
        "HP +65",
        "Получаемый крит. урон -3"
      ],
      "+11": [
        "Защита +22",
        "HP +70",
        "Получаемый крит. урон -4"
      ],
      "+12": [
        "Защита +24",
        "HP +75",
        "Получаемый крит. урон -5"
      ],
      "+13": [
        "Защита +26",
        "HP +80",
        "Получаемый крит. урон -6"
      ]
    }
  },
  {
    "name": "Мифриловые сапоги",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +5"
      ],
      "+1": [
        "Защита +6"
      ],
      "+2": [
        "Защита +7"
      ],
      "+3": [
        "Защита +8"
      ],
      "+4": [
        "Защита +9"
      ],
      "+5": [
        "Защита +10"
      ],
      "+6": [
        "Защита +11"
      ],
      "+7": [
        "Защита +13",
        "Шанс получить крит. удар -1"
      ],
      "+8": [
        "Защита +15",
        "Шанс получить крит. удар -1"
      ],
      "+9": [
        "Защита +17",
        "Шанс получить крит. удар -2"
      ],
      "+10": [
        "Защита +19",
        "Шанс получить крит. удар -3"
      ],
      "+11": [
        "Защита +21",
        "Шанс получить крит. удар -4"
      ],
      "+12": [
        "Защита +23",
        "Шанс получить крит. удар -5"
      ],
      "+13": [
        "Защита +25",
        "Шанс получить крит. удар -6"
      ]
    }
  },
  {
    "name": "Сапоги Бафомета",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +6"
      ],
      "+1": [
        "Защита +7"
      ],
      "+2": [
        "Защита +8"
      ],
      "+3": [
        "Защита +9",
        "Все параметры +1"
      ],
      "+4": [
        "Защита +10",
        "Все параметры +2"
      ],
      "+5": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Все параметры +3"
      ],
      "+6": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Все параметры +4"
      ],
      "+7": [
        "Защита +14",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Все параметры +5"
      ],
      "+8": [
        "Защита +16",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2",
        "Все параметры +5"
      ],
      "+9": [
        "Защита +18",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Все параметры +6"
      ],
      "+10": [
        "Защита +20",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4",
        "Все параметры +6"
      ],
      "+11": [
        "Защита +22",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Все параметры +7"
      ],
      "+12": [
        "Защита +24",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Все параметры +7"
      ],
      "+13": [
        "Защита +26",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Все параметры +8"
      ]
    }
  },
  {
    "name": "Сапоги Велкена",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +5",
        "Благодаря легкому весу, позволяют увернуться от атак противника."
      ],
      "+1": [
        "Защита +6",
        "Благодаря легкому весу, позволяют увернуться от атак противника."
      ],
      "+2": [
        "Защита +7",
        "Благодаря легкому весу, позволяют увернуться от атак противника."
      ],
      "+3": [
        "Защита +8",
        "Благодаря легкому весу, позволяют увернуться от атак противника."
      ],
      "+4": [
        "Защита +9",
        "Благодаря легкому весу, позволяют увернуться от атак противника."
      ],
      "+5": [
        "Защита +10",
        "Благодаря легкому весу, позволяют увернуться от атак противника."
      ],
      "+6": [
        "Защита +11",
        "Благодаря легкому весу, позволяют увернуться от атак противника."
      ],
      "+7": [
        "Защита +13",
        "Благодаря легкому весу, позволяют увернуться от атак противника.",
        "Получаемый крит. урон -1"
      ],
      "+8": [
        "Защита +15",
        "Благодаря легкому весу, позволяют увернуться от атак противника.",
        "Получаемый крит. урон -1"
      ],
      "+9": [
        "Защита +17",
        "Благодаря легкому весу, позволяют увернуться от атак противника.",
        "Получаемый крит. урон -2"
      ],
      "+10": [
        "Защита +19",
        "Благодаря легкому весу, позволяют увернуться от атак противника.",
        "Получаемый крит. урон -3"
      ],
      "+11": [
        "Защита +21",
        "Благодаря легкому весу, позволяют увернуться от атак противника.",
        "Получаемый крит. урон -4"
      ],
      "+12": [
        "Защита +23",
        "Благодаря легкому весу, позволяют увернуться от атак противника.",
        "Получаемый крит. урон -5"
      ],
      "+13": [
        "Защита +25",
        "Благодаря легкому весу, позволяют увернуться от атак противника.",
        "Получаемый крит. урон -6"
      ]
    }
  },
  {
    "name": "Сапоги Ифрита",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +7",
        "Скорость бега +3"
      ],
      "+1": [
        "Защита +8",
        "Скорость бега +6"
      ],
      "+2": [
        "Защита +9",
        "Скорость бега +9"
      ],
      "+3": [
        "Защита +10",
        "Шанс получить крит. удар -1",
        "Скорость бега +12"
      ],
      "+4": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Скорость бега +15"
      ],
      "+5": [
        "Защита +12",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Скорость бега +18"
      ],
      "+6": [
        "Защита +13",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Скорость бега +21"
      ],
      "+7": [
        "Защита +15",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -2",
        "Скорость бега +24"
      ],
      "+8": [
        "Защита +17",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Скорость бега +27"
      ],
      "+9": [
        "Защита +19",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -4",
        "Скорость бега +30"
      ],
      "+10": [
        "Защита +21",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Скорость бега +33"
      ],
      "+11": [
        "Защита +23",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Скорость бега +36"
      ],
      "+12": [
        "Защита +25",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Скорость бега +39"
      ],
      "+13": [
        "Защита +27",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -8",
        "Скорость бега +42"
      ]
    }
  },
  {
    "name": "Сапоги новичка",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +4"
      ]
    }
  },
  {
    "name": "Сапоги тьмы",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +4"
      ]
    }
  },
  {
    "name": "Сапоги энергии Ифрита",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +7",
        "Скорость бега +3"
      ],
      "+1": [
        "Защита +8",
        "Скорость бега +6"
      ],
      "+2": [
        "Защита +9",
        "Скорость бега +9"
      ],
      "+3": [
        "Защита +10",
        "Шанс получить крит. удар -1",
        "Скорость бега +12"
      ],
      "+4": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Скорость бега +15"
      ],
      "+5": [
        "Защита +12",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Скорость бега +18"
      ],
      "+6": [
        "Защита +13",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Скорость бега +21"
      ],
      "+7": [
        "Защита +15",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -2",
        "Скорость бега +24"
      ],
      "+8": [
        "Защита +17",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Скорость бега +27"
      ],
      "+9": [
        "Защита +19",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -4",
        "Скорость бега +30"
      ],
      "+10": [
        "Защита +21",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Скорость бега +33"
      ],
      "+11": [
        "Защита +23",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Скорость бега +36"
      ],
      "+12": [
        "Защита +25",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Скорость бега +39"
      ],
      "+13": [
        "Защита +27",
        "Шанс получить крит. удар -7",
        "Получаемый крит. урон -8",
        "Скорость бега +42"
      ]
    }
  },
  {
    "name": "Сапоги ярости Бафомета",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +6"
      ],
      "+1": [
        "Защита +7"
      ],
      "+2": [
        "Защита +8"
      ],
      "+3": [
        "Защита +9",
        "Все параметры +1"
      ],
      "+4": [
        "Защита +10",
        "Все параметры +2"
      ],
      "+5": [
        "Защита +11",
        "Шанс получить крит. удар -1",
        "Все параметры +3"
      ],
      "+6": [
        "Защита +12",
        "Шанс получить крит. удар -1",
        "Получаемый крит. урон -1",
        "Все параметры +4"
      ],
      "+7": [
        "Защита +14",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -1",
        "Все параметры +5"
      ],
      "+8": [
        "Защита +16",
        "Шанс получить крит. удар -2",
        "Получаемый крит. урон -2",
        "Все параметры +5"
      ],
      "+9": [
        "Защита +18",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -3",
        "Все параметры +6"
      ],
      "+10": [
        "Защита +20",
        "Шанс получить крит. удар -3",
        "Получаемый крит. урон -4",
        "Все параметры +6"
      ],
      "+11": [
        "Защита +22",
        "Шанс получить крит. удар -4",
        "Получаемый крит. урон -5",
        "Все параметры +7"
      ],
      "+12": [
        "Защита +24",
        "Шанс получить крит. удар -5",
        "Получаемый крит. урон -6",
        "Все параметры +7"
      ],
      "+13": [
        "Защита +26",
        "Шанс получить крит. удар -6",
        "Получаемый крит. урон -7",
        "Все параметры +8"
      ]
    }
  },
  {
    "name": "Стальные сапоги",
    "slot_code": "boots",
    "upgrade_levels": {
      "+0": [
        "Защита +4"
      ]
    }
  }
];
